{
    "title": "What is K-Beauty, why is it so popular and where can you buy Korean cosmetics in the UK? | The Sun",
    "text": "Korean beauty and skincare products are the new beauty trend to become a phenomenon. Find out all you need to know about K-Beauty here. All recommendations within this article are informed by expert editorial opinion. If you click on a link in this story we may earn affiliate revenue. SINCE 2016, K-Beauty has become somewhat of a phenomenon, with women all over the world looking to achieve that luminous glow. But if you're not clued up on the beauty trend, don't worry - here's everything you need to know about K-Beauty and why it has become so popular... K-Beauty is a term which refers to Korean skincare, and is widely used across the globe. The beauty trend is focused on the 'glass skin' look, which (to you and me) means a healthy glow. The Korean beauty scene is quite different from ours - the ideal is to have pigment-free, hydrated skin, and to not rely on makeup as much. Western beauty has, as a result, seen an influx of beauty brands and products that claim to do just that - including those Instafamous gloopy sheet masks. There's no denying the allure of pristine, fresh-looking skin. K-Beauty is all about treating your skin well and sticking to a strict regimen to get those fabulous results. Women are much more open to the idea of wearing minimal or no makeup at all. And as for contouring? That's becoming a thing of the past. One of the most important stages in the K-Beauty regime is cleansing. While this might not sound groundbreaking, it is an essential process to purify the skin and get rid of any pollution. We recommend having a separate cleanser for your eye makeup, as this area is particularly sensitive. To be sure you get rid of all the dirt and build-up, always cleanse twice. Exfoliating helps remove dead skin cells and impurities. This stage can be quite aggressive, particularly on sensitive skin, so only do this once or twice a month. It is also recommended that you only apply your exfoliant to your T-Zone, as this is the area most prone to oiliness. Those who have particularly oily or acne-prone skin may find they need to exfoliate more regularly to clear excess sebum. Often a step that is overlooked, toning your skin is something you should be doing. Not only does it help remove any leftover makeup, dirt or pollution, it acts as a primer for other products in your regime. Toner also has the benefit of adding moisture to your skin. This helps relieve any irritation or erythema (pinkness) from the first few stages. Serums are used to apply highly-concentrated ingredients to the skin. They help smooth and hydrate the skin. Most K-Beauty serums include hyaluronic acid, which is a naturally-occurring compound in the skin that attracts and absorbs water. Your skin will start to look and feel great at this point. The last stage in this extensive skincare ritual is treatments. While they resemble something from a horror film, sheet masks are ultra-hydrating and leave your skin feeling fresh. Apply the mask onto clean skin and let the ingredients sink into your pores. You normally have to keep the mask on for 10-15 minutes, so pour yourself a cup of tea while you wait to see the results. ©News Group Newspapers Limited in England No. 679215 Registered office: 1 London Bridge Street, London, SE1 9GF. \"The Sun\", \"Sun\", \"Sun Online\" are registered trademarks or trade names of News Group Newspapers Limited. This service is provided on News Group Newspapers' Limited's Standard Terms and Conditions in accordance with our Privacy & Cookie Policy. To inquire about a licence to reproduce material, visit our Syndication site. View our online Press Pack. For other inquiries, Contact Us. To see all content on The Sun, please use the Site Map. The Sun website is regulated by the Independent Press Standards Organisation (IPSO) Our journalists strive for accuracy but on occasion we make mistakes. For further details of our complaints policy and to make a complaint please click this link: thesun.co.uk/editorial-complaints/ ",
    "datetime": "2018-02-08T11:55:17+00:00",
    "url": "https://www.thesun.co.uk/fabulous/5528324/k-beauty-trend-korean-skincare-uk/"
}