{
    "title": "Where to Find a K-Beauty Bonanza: HallYu Cosmetics | Houstonia Magazine",
    "text": "Houstonia Magazine\n\n1416 NW 46th Street, Suite 105, PMB 136, Seattle WA 98107Phone: 713-862-4570 • Fax: 713-862-4606 By\nEmily Juhasz\n\n\nMay 16, 2017 The neatly arranged display tables at HallYu Cosmetics are perfect for testing everything. Image: Emily Juhasz I always feel like a little girl in a candy store whenever I enter a shop that sells makeup. Maybe it’s the endless dazzling palettes or the salesperson telling me how amazing I look with the products smeared on my face, or the fact that I can swatch 10 million colors onto my hand and not be looked at like a crazy person—at least I’ve been assured that’s normal. No matter the scenario, I always leave feeling like a million bucks. But walking in HallYu Cosmetics is a beauty experience like no other. HallYu is a Houston-based shop dedicated to Korean skincare and cosmetics, also known as K-beauty. Located on the thriving Asian district along Bellaire, its a hidden gem with an emphasis on hidden. Owners recently re-designed the store logo and are currently in between signs, which doesn't do much to help, but I can assure you it is open and ready to make your K-beauty dreams a reality. I choose you, Pokémon cleanser. Image: Emily Juhasz As soon as I walked through the doors, everything I thought I knew about makeup went out the window. Beauty destinations like Sephora, Target and Ulta have increasingly been adding buzzy Korean lines to their shelves, but HallYu Cosmetics is different. Not only had I entered a cosmetic paradise, it's a total immersion in K-beauty culture. HallYu carries about 20 different Korean brands. Some, like Tony Moly, are the Asian version of drugstore staples like Maybelline, while others are more specialty lines with price points similar to, say, Smashbox or other Sephora brands. While I explored the options, Hallyu's executive administrator Melody Vo caught up with me and explained that even though shops like HallYu Cosmetics are capitalizing on a global craze—overseas sales of Korean beauty products rose 73 percent in 2015—they are still fairly under the radar in Houston. “I think there are many people in Houston who don’t realize that there are shops that sell specialty items like Lolita fashion or Korean cosmetics, but when they do find out they’re just wondering why they didn’t know about it sooner!” she says. “We pride ourselves on the fact that we do carry a variety of products from brands that people can choose and learn more about.” The store has a soothing atmosphere almost reminiscent of a spa—clean yet inviting with bare walls and mirrors set above and perfectly angled downward for shoppers to watch themselves test out samples. I was surprised to learn that Korean skincare is actually quite different from my dry and drab routine. The typical Korean skincare routine famously includes up to 10 steps in order to maintain an all-around healthy complexion. Yes, these are PowerPuff Girl cushion compacts, and, yes, I'm obsessed. Image: Emily Juhasz I didn’t recognize many of the labels, but one line that made my heart flip was TonyMoly, which to my delight released a Pokémon collection last year. The Pikachu eye shadow palette is literally everything. Another brand, PeriPera, had me some sort of way with its Power Puff Girls collection. And I thought the recent Clinique collaboration with Crayola was something special. Whether you’re a makeup newbie or a makeup artist extraordinaire, HallYu Cosmetics provides an all-encompassing experience that brings K-beauty to our own backyard. HallYu Cosmetics is located at 12168 Bellaire Blvd., hallyucosmetics.com Beauty & Brains 08/29/2022\n\nBy\nDanielle Wright Clutch City 03/30/2022\n\nBy\nDanielle Wright\n\n\nPhotography by\nDavid “Odiwams” Wright Brow Guru 03/10/2022\n\nBy\nDanielle Wright Getting To The Root 09/30/2021\n\nBy\nDanielle Wright\n\n\nEdited by\nShelby Stewart ",
    "datetime": null,
    "url": "https://www.houstoniamag.com/style-and-shopping/2017/05/where-to-find-a-k-beauty-bonanza-hallyu-cosmetics"
}