{
    "title": "Where to find the hottest Korean skin care products? Try this tiny St. Paul storefront",
    "text": "It smells like a moisturizer. It goes on like paste. It’s been said to have anti-aging effects that stimulate skin elasticity, repairs damage and restores hydration. It’s ... snail slime. Korean skin care products such as this are taking the internet by storm. Known as K-beauty, some of these products can seem pretty weird (bee venom is another popular phenomenon), but they’re catching on in the United States. No, not every American woman uses carbonated masks or vacuuming for their pores. But that’s quickly changing on the coasts. And the Twin Cities — specifically St. Paul — are slowly embracing the trend. Korean-Americans founded popular online boutiques such as Soko Glam and Peach & Lily, which offer arrays of products for all kinds of skin conditions. There’s the Neogen Pore Refine Serum for blackheads. The Super Aqua Cell Renew Snail Cream for acne. The Yuja Water C Whitening Ampoule serum for pigmentation. And for curious Twin Cities residents who want to see the products in person, there’s one go-to spot. At the Hmong Village mall in St. Paul, there’s a small store called Happy Peach. It offers what is probably Minnesota’s widest selection of South Korean beauty products: carbonated clay masks, cream made with egg yolk extract, bubble tea sleeping packs, aloe vera moisturizers and oil-based cleansers specifically for men.    \n\n\n\n\n\n\n                    ELIZABETH FLORES, Star Tribune\n                \n\n                                            Happy Peach stocks an array of K-beauty products such as this carbonated face mask. Owner Kha Vang started Happy Peach in 2015, promoting her products primarily via social media. She opened the permanent location at Hmong Village last year. A general interest in Korean culture and K-pop (aka Korean pop music) led Kha to discover K-beauty in 2014. After ordering some products online, she traveled to South Korea that very year to talk with brokers about bringing products to the States. She started with beauty brands that interested her personally, such as those from Etude House. She now visits South Korea once a year to bring back customer-requested products in addition to doing smaller monthly shipments. With more than 10 different brands in-store, Happy Peach manager Mai Vang (Kha’s sister) said the selection continues to grow as K-beauty gains popularity. “It’s honestly because everything is more natural and way cheaper,” Mai said. “Our customer base goes from teenagers to people who are 50 and want to look younger.” Natural ingredients “Korean skin care is not for the person who’s like, ‘I want to wash my face and go,’ ” said Minneapolis blogger and beauty expert Elizabeth Dehn. “It’s for people that are really passionate about the skin care regimen, and meticulous.” Minneapolis’ Salon Rouge manager and makeup artist Jeffrey Dunn attributes K-beauty’s popularity to its low prices, partly due to the South Korean government’s subsidizing of the industry. “It’s a really large export,” said Dunn, who stocks a small selection of Korean facemasks at his salon. “And they’re innovative because they have some of the oldest recorded skin care recipes of any country.” Dunn added that Korean skin care products use more natural ingredients to achieve hydrated, clear skin. While Americans tend toward drying treatments such as mud masks and exfoliating cleansers, Koreans load up on hyaluronic acid to pump water into their skin. And they favor fermented ingredients, which Dunn said are more stable and sustainable than moisture-sucking ingredients. At Happy Peach, where most of the clientele comes from the Twin Cities Hmong and Korean communities, the Vang sisters dole out K-beauty recommendations for all sorts of skin types, from dry to oily to acne-prone. But one of K-beauty’s biggest virtues, they say, is the emphasis on different brands and products for varying ages. Etude House specializes in cleansers and toners for the “younger generation,” said Mai, because their products go on lighter. She advises those 30 and older to try Missha products, moisturizers and serums that have heavier consistencies (and recently landed at Target). Also for more mature women, the snail solution cleanser and egg mellow cream is a way to soften the effects of aging, she said. “My skin has become a lot better since I started using these products in high school,” customer Xania Nharav said. “Korean beauty products do an excellent job at meeting my expectations in quality and appearance,” customer Julie Lo said. “And, of course, the packaging is cute.” Nhia Vang of Wausau, Wis., occasionally comes to the Twin Cities and picks up “affordable and effective” products at Happy Peach. “I’ve never really taken care of my face up until three years ago, when I had bad acne and breakouts,” she said. “I started getting facials and bought all the prestigious skin care products that have been proven to work, yet I wasn’t getting any results. Then a Korean sister showed me this peeling gel, and after two weeks, I noticed that my face was clearing up. That’s when I went into a Korean skin care frenzy.” Dehn swears by pore clearing sheet masks, which can have ingredients such as avocado, rice or even red wine. As the K-beauty industry continues to grow with “wonderful, multi-tasking natural” products, Dehn thinks curiosity in the West will continue to climb. “Women get bored of their beauty,” she said. “So we are always looking for the next thing. I think we’re just a more globally minded culture now, and that extends into beauty and fashion.” © 2023 StarTribune. All rights reserved. ",
    "datetime": null,
    "url": "https://www.startribune.com/where-to-find-the-hottest-korean-skin-care-products-try-this-tiny-st-paul-storefront/436765883/"
}