{
    "title": "Where Does Korean Skincare Fit Into the Natural Beauty Scope? | Teen Vogue",
    "text": "By Sable Yong Those of us fully entrenched in the K-beauty world of 10-step skin care regimens, radioactively dewy complexions, and adorable-looking products lining our medicine cabinets, can pretty much extol the virtues of all South Korea has to offer in terms of amazingly hardworking and affordable beauty products. While we can confidently state that there is a K-beauty regimen out there for everyone, those who are staunch natural beauty subscribers may shy away for lack of being able to pronounce many of the ingredients found in Korean beauty products (some of which are synthetic as well as botanical in origin). Culturally speaking, the beauty aficionados of South Korea prize products that they believe will work, rather than products purported to be safe. Luckily, research and development from Korean beauty brands is so intensely competitive in formulating foolproof products that efficacy often denotes safety. After all, if a product works and works well, it has to be safe too, right? But now that K-beauty has infiltrated the western realm, expectations are a bit varied, and the rest of the world does have a desire for naturalness or a transparency of origin in their beauty products. If you find yourself in that camp, don’t be afraid to try Korean beauty brands — in fact, if you know where to look, you’ll find a global treasure trove of natural beauty that goes way beyond the usual suspects (nothing against argan or rose hip oil, but how about some variety). Just ask Sarah Lee and Christine Chang, founders of Glow Recipe — an e-comm beauty site that curates the best natural beauty products coming out of Korea. Since so much of Korean beauty promotes the image of a youthful healthy glow, trends like the gradation or “bitten” lip and mul-kwang-pi-bu (meaning an uber-dewy complexion) are those signifiers that Korean beauty products try to recreate. “Korean skincare and makeup are all about enhancing natural beauty rather than covering imperfections. Koreans love using natural ingredients and are constantly looking for skincare formulations with natural ingredients, that are highly concentrated, as they prefer a gentle, yet effective result, rather than a dramatic transformation,” Sarah and Christine say. You’re not likely to find the words “natural” or “organic” on Korean beauty products, since they’re formulated in their own unique and specific ways. In order to keep the amount of fillers low and maintain a higher percentage of natural ingredients, lots of products will say “zero water,” meaning they aren’t watered down or diluted, so to speak. Fermentation is a hugely popular skin care formulation process, extended from Korean cuisine that includes such fermented dishes as kimchi, soybean paste, and rice wine. “Fermentation allows ingredients to break down into micro particles, which enables a deeper and more efficient absorption into the skin, rather than the formula sitting on the surface of the skin,” Sarah and Christine explain. “In addition, it prevents the usage of artificial preservatives, which is another strong benefit.” Whamisa is a brand that pioneered the fermentation trend, but you may be familiar with SK-II, whose sheet masks and cult-status essence are prized for its star ingredient, pitera — a rice wine ferment that can basically do to your skin what a witch does to that rose in Beauty and the Beast to keep it fresh forever. Sourcing ingredients locally, as any culture does, is another natural ingredient goldmine. Jeju Island in South Korea is a veritable Garden of Eden when it comes to ingredient sourcing. In fact, one Korean beauty brand, Blossom Jeju, uses all of what the island has to offer in its products. Innisfree is another popular Korean brand that sources from Jeju. Ingredient-specific product lines are not uncommon, just like with any skin care line. You’ll find sea kelp, soybean, green tea, lotus, and camellia, for instance, in the name of such products — a sign that it is most likely natural ingredient-based. Don’t assume that natural Korean beauty products are the underdog. As it so happens, one of the #1 moisturizers in the entire prestige market of Korean beauty brands is from Belif, a brand that strictly uses herbal ingredients in its formulations. While some of us may stick to beauty products with natural ingredients for fear of immediate irritation or long-term adverse effects from synthetics, Korean women reach for natural ingredients because they’re able to fulfill their beauty desires in a “harsh-free” way — and if you can have both, why wouldn’t you? “Korean women are the most sophisticated and demanding consumers when it comes to skin care. They prioritize and are highly knowledgeable about what they put on their faces,” Sarah and Christine say. “More and more women are demanding natural ingredients that are gentle on their skin, but at the same time deliver results.” By Lexi McMenamin By Sara Delgado By Anjana Pawa Related: Get To Know Korea's Rainbow-Haired Beauty Muse Irene Kim By Teen Vogue Style Team By Zack Budryk By Ashleigh Carter By Rachel Janfaza More from Teen Vogue Contact © 2023 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Teen Vogue may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad Choices ",
    "datetime": "2015-10-20T19:16:15.990Z",
    "url": "https://www.teenvogue.com/story/korean-skincare-meets-natural-beauty"
}