{
    "title": "Who Is Pony Makeup? 7 Things To Know About Korea's Most Famous Beauty Guru",
    "text": "Fashion  With over 600,000 subscribers on YouTube, Pony is one of South Korea's most famous beauty gurus. Her real name is Hye-Min Park, though nearly everyone refers to her by her equine nickname. She's been blogging about Korean beauty for years, so if you're looking for K-beauty inspiration, look no further than Pony. The easiest way to learn about Pony is by watching her expertly executed and extremely chatty makeup tutorials, which will teach you everything from how to craft the perfect smoky eye to how to recreate K-pop idols' glam. (Don't be intimidated by the language barrier. Most of Pony's videos are subtitled in English, and they're all so well-made that it's easy to follow along even if you don't understand a word of Korean.) However, Pony is so much more than just her YouTube channel. Both an expert and a trendsetter, Pony is the Korean beauty guru to watch. As K-pop and Korean beauty products continue to rise in popularity in the United States, you're sure to start seeing her signature pink mane everywhere. If you're looking to hop on the wave or just learn more about one of South Korea's most famous makeup artists, here are seven things to know about Pony. Though Pony has been blogging about beauty for many years, part of her recent rise in popularity in the beauty world has been due to her partnership K-pop star CL. Though CL is a style icon in her own right, the K-pop star's glam has definitely been influenced by Pony, and people are taking notice. Pony wasn't always a celebrity makeup artist or a celebrity in her own right. In an interview with Soompi, a Korean pop culture website, Pony explained that she always loved drawing and went to university to become a graphic designer. She worked in an office for a while but was never truly passionate about it. Pony's Celeb Makeup Book — Pony's Makeup Book Vol. 3, $30, Amazon It was while working as a graphic designer that Pony was approached by a publishing company to write a makeup book, as she explained in the same interview with Soompi. Pony has written and published four books about beauty. You can order them online, but English-speakers be warned: They are only available in Korean. The books do, however, contain loads of gorgeous, glossy images that are sure to provide makeup inspo for anyone who picks them up.  Especially not pink! Her signature hair color is a bright pink, which she maintains at home. (She revealed in a Q&A video that her boyfriend dyes her hair and bleaches her roots, which is true love if I've ever heard it.) Her love for bright colors, including pink, extends to her makeup, and many of her YouTube tutorials are for rosy gold looks. Though Pony is Korean, she is aware and conscious of her international fans and tries to create tutorials that will be of interest and relevant to their lives. The most famous (and perhaps controversial) among these is her hijab makeup tutorial. She explained to Soompi, \"Among my international fans, many of them reside in countries where wearing a hijab is common, so I wanted to create a makeup tutorial for them and be able to identify with.\"  Pony partnered up with Memebox, a subscription box company that focuses on curating Korean beauty products and cosmetics, to create her own line. The range includes eyeshadow palettes for easy glam, dewy lipsticks, and nail polishes in bright, tropical colors. The line with Memebox has been so successful that Pony is going to be striking it out on her own soon. According to a recent announcement on Twitter, she's working on her own makeup brand, to be called Pony Effect. Check Out Memebox x Pony Makeup  Recently, Pony has been spotted in the streets wearing a mask. She explained in a Q&A video on YouTube that the mask is not to prevent being recognized, because she's hard to miss with that signature pink hair, but to prevent others from taking her picture without her consent. Though Pony's star is rising, it's clear she wants to keep her personal life separate, and so far, her fans have been respectful of this request. She did add that she doesn't mind being recognized, \"So if you see me outside, say hi!\" So if you're looking to learn how to do your makeup like a K-pop star from someone who's totally down to earth, go follow Pony now. Image: PonyMakeup/YouTube Choose an edition: ",
    "datetime": null,
    "url": "https://www.bustle.com/articles/121183-who-is-pony-makeup-7-things-to-know-about-koreas-most-famous-beauty-guru"
}