{
    "title": "Why Korean Beauty Isn't For Everyone | Teen Vogue",
    "text": "By Krithika Varagur Korean skincare is less a market niche than an apothecary of specialized products for every imaginable skin problem, condition, or aspiration: redness, dryness, a pearlescent glow. It became a global phenomenon partly in reaction to our Western fixation with cure-all and all-natural products. Korean makeup, on the other hand, is the Brandy Melville of the beauty world, in its conviction that “one size fits most.” Within high-tech Korean cosmetics like cushion compacts and BB/CC creams, there are routinely few to no options for girls with darker skin. The “Signature Essence Cushion” from Missha, for instance, comes in two colors: light beige and natural beige. (And if the “natural beige” girl tans…?) Admittedly, this is likely not a problem in its country of origin, where most women are ethnic Koreans whose skin tones are served best by those varying shades of beige. But if K-beauty is shooting for a global market, shouldn't it address people of color better than it does currently? “In the Western world, 60-70% of Korean beauty consumers are non-Asian,” Charlotte Cho, founder of e-commerce site Soko Glam tells Teen Vogue. She said that current product offerings for darker-skinned women are limited because “up until last year, the primary focus of Korean cosmetics companies has been on the Asian market, where there aren't a wide range of skin tones.” Cho cited Amore Pacific and Missha as “established” brands with relatively more color options. But Missha’s “Perfect Cover” BB cream comes in five shades, all variations on “beige.” AmorePacific’s tinted moisturizer comes in four, ending at “Medium,” which was still too light for me in dead winter. It’s frustrating for darker-skinned girls to be shut out of products that seems to inspire religious fealty. It’s almost a throwback to the beauty landscape of just a decade past, when high-end makeup brands like Chanel and YSL could afford to cut off their cosmetics around the “olive” mark. Maybe “afford” is the key word here: if it’s profitable for Korean brands to keep making just a few shades, why would they change? In the past, beauty industry change has happened through a combination of cultural outcry and basic economics. If Korean cosmetics do expand their range, they will likely find eager consumers with outsize purchasing power. Black women spend $7.5 billion on beauty products every year, for example, and 80% more on cosmetics than other consumers. But companies mostly learn about the demand for certain products when their customers speak out. Alicia Yoon, founder of the Korean beauty e-commerce site Peach and Lily, says as much: “When I speak to Korean beauty brands, they are aware of this market, and say they are looking to expand once the demand grows large enough,” she tells Teen Vogue. The consumer demand for more diverse Korean products has been muted so far, save for a handful of beauty bloggers. And not just because the Korean beauty market is so new. Women may hesitate to speak out because of the fact that these products aren’t from America, where diversity is almost a cultural mandate, but from a foreign country and culture. Maybe this is just “the way things are,” and the way these products will be. This line of thought is a mistake. It’s unlikely that we would accept it if, say, Nars offered a foundation just in four “beige” tones. We should hold Korean companies who sell to Americans by the same standard. Diversity in makeup doesn’t even have to be a racially loaded proposition. The supermodel Iman, whose makeup company was one of the first to serve dark-skinned women, uses the term “women with skin of color” instead of “women of color” to emphasize that women have more in common as one consumer group than they do in separate buckets: some “have darker complexions and that’s it” (as writer Elizabeth Sevran put it). By this logic, providing darker makeup options is simply a supply-demand issue, not one of cultural shaming. Yoon says she’s already having conversations with the brands she stocks at Peach & Lily to offer more skin tones for her American consumers. “The timing will be all about how quickly the market demand grows — once it’s big enough, I believe the products will be available,” she said. “In the meantime, other makeup products like eyeliners, mascara, eyeshadows, blushes, and lip products can be great for everyone, regardless of skin tone,” said Yoon. This is half true. In reality, even color cosmetics like lipstick and blush usually have to be formulated differently for dark-skinned women: more pigmented, and with options for warm or cool undertones. This is why a product like MAC’s best-selling Studio Fix foundation comes in 37 shades. (that doesn’t make the point about lipsticks and blush) By Lexi McMenamin By Sara Delgado By Anjana Pawa Expanding their target audience will be no small task for Korean cosmetics companies. The overhaul may take a while, especially given the exacting formulations for which they’re known. In the meantime, we’ll try to figure out what essence really is. Related: I Traded My Lazy-Girl Beauty Routine for an 11-Step Korean Skincare Regimen By Anoushka Lal By Sara Delgado By Gabi Thorne By Kaitlyn McNab More from Teen Vogue Contact © 2023 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Teen Vogue may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad Choices ",
    "datetime": "2016-05-12T18:53:44.212Z",
    "url": "https://www.teenvogue.com/story/korean-makeup-not-for-everyone-no-darker-shades"
}