{
    "title": "Why Ayurveda could be the next K-beauty - Glossy",
    "text": "When Shrankhla Holecek founded her Ayurvedic-based beauty line Uma Oils in 2016, though inspired by the ancient wellness ritual, she leaned more heavily into selling traditional beauty products such as facial oils and cleansers to appeal to a U.S. customer. “When we launched three years ago, I made a deliberate attempt to steer clear of pure Ayurvedic terms like the three doshas — Vata, Pitta, and Kapha — because of what I thought the industry and customer were ready for. Over the last six months, I’ve had a rethink,” said Holecek. Ayurveda is a more-than-5,000-year-old Indian holistic health system. As the beauty market has moved more toward wellness, the use of Ayurvedic approaches and branding has also grown. Aromatherapy brand GuruNanda sells its essential oils in Walmart stores, and skin-care company Sahajan sells its eye creams in Credo locations, as well as on Amazon. The brand was also part of Sephora’s inaugural Accelerate incubator program. Holecek has debuted more esoteric Ayurvedic beauty products as of late: a naval oil in June to aid digestion and skin health, a décolletage serum in October for anti-aging, and she’ll launch an eyebrow oil early next year. These “beauty from the inside out” products have grown to be about 35% of Uma Oils’ annual sales versus its traditional skin-care items. The company, which is sold in Neiman Marcus, Saks Fifth Avenue, The Detox Market and on its e-commerce site, hit just under $5 million in retail sales this past year and is projected to hit $25 million by 2021, said Holecek. “In developed countries across Europe and North America, busy and hectic lifestyles have caused consumers to find a balance in their [lives] through meditation, yoga and conscious eating, which are sister concepts to Ayurveda,” said Pradeep Srinivasan, Euromonitor International research analyst. “Their growing adoption has aided the popularity of Ayurvedic beauty formulations.” An unlikely advocate for Uma Oils has been luxury retailer Neiman Marcus, where it is merchandised in its Trending Beauty assortment. The aforementioned products had short-term, three-month exclusives with the retailer before going into wider distribution. “We see Uma as an integral part of our clean beauty assortment. Customers are asking more questions about ingredients and are interested in products that have a wellness benefit,” said Michelle Gill, Neiman Marcus Group’s vp and divisional merchandise manager who oversees beauty. Ranavat Botanics is another Ayurveda beauty brand in Neiman Marcus’ merchandising assortment, and Vie Healing, which is inspired by Chinese medicine, is a new brand that’s selling product and offering services in its Beverly Hills store. That U.S. luxury consumers are becoming more willing to spend on Ayurvedic beauty products is no surprise to Srinivasan, who is seeing this trend among Indian customers, as well. According to Euromonitor data, nearly 41% of Indian consumers prefer premium formulations while buying skin and hair-care products, as compared to 21% of customers choosing lower-price, mass products. “Homegrown Indian Ayurvedic companies, like Forest Essentials and Kama Ayurveda identified that the industry was dominated by mass brands; therefore, they launched products with premium formulations, appealing packaging and colorful print campaigns to change consumers’ perception of Ayurveda by associating it with luxury and wellness,” Srinivasan said. “While Indians are known to be price-conscious, rising disposable income and higher discretionary spending have fueled the willingness to spend on premium products.” To support the rollout of Uma Oils’ products in Neiman Marcus stores, as well as at other retail partners, the brand has relied heavily on field training and sampling. The U.S. field team consists of four sales leaders who travel weekly to all Neiman Marcus locations and work with about 30 to 35 sales associates, said Monica Gallegos, Uma Oils vp of worldwide sales. For Black Friday, these sales associates will receive more than 6,000 samples from Uma Oils to inform customers about the brand and its products. And to create digital support, Uma Oils will roll out an online customer service training guide in mid-November, so shoppers that reach out to the Neiman Marcus by phone or online chat will also be well-versed. Holecek said these training exercises have required an investment of just over $1 million thus far in 2019. “We require all of our beauty and wellness brands to be in our stores for education purposes, but these kinds of brands that speak to Ayurveda or holistic health [are] even more important,” said Gill. “We need to ensure that we can explain to our customers what they can expect. Our consumers’ concept of beauty is expanding, and so we are expanding with it.” Get news and analysis about fashion, beauty and culture delivered to your inbox every morning. ",
    "datetime": "2019-11-01T04:00:51+00:00",
    "url": "https://www.glossy.co/beauty/why-ayurveda-could-be-the-next-k-beauty/"
}