{
    "title": "Why K-beauty is losing its lustre in China | Vogue Business",
    "text": "To revisit this article, visit My Profile, then View saved stories To revisit this article, select My Account, then View saved stories To revisit this article, visit My Profile, then View saved stories To revisit this article, select My Account, then View saved stories Sign up to our newsletter for a truly global perspective on the fashion industry Enter your email to receive editorial updates, special offers and breaking news alerts from Vogue Business. You can unsubscribe at any time. Please see our privacy policy for more information. By Vogue Business Team To receive the Vogue Business China Edit, sign up here. While K-pop stars and Korean popular culture continue to fascinate multitudes of Chinese fans, K-beauty is struggling to maintain its relevance. According to data released by the Foundation of Korea Cosmetic Industry Institute in May, exports of Korean cosmetics to mainland China increased 14.3 per cent in 2019 to just over $3 billion. The double-digit increase is a much slower rate compared to years prior: the average annual increase between 2013 and 2018 was 41 per cent. “In China, the demand for Korean cosmetics is not exploding as it did before,” says Park Eunjeong, an analyst with Yuanta Securities. In the 1990s and 2000s, Korean beauty conglomerates like Amorepacific and LG Household & Health Care brought their products to the forefront of the Chinese beauty market by savvily riding the Korean Wave, the popularity of South Korean pop culture driven by K-dramas and K-pop that started in the 1990s. Amorepacific, for example, enlisted popular figures like K-drama star Jun Ji-hyun and reality show Produce 48 contestant Kim Doah as a spokeswomen for its brand Etude House. The conglomerate also successfully “planted” a number of products in K-dramas like My Love from the Star, often boosting sales by double digits. Korean-style makeup tutorials to recreate K-drama looks soon caught on on social media platform Weibo. By Kati Chitrakorn Despite the popularity of Korean cultural and beauty products, politics took a first stab at the market in 2017, when tensions over the US THAAD missile system on the Korean peninsula led China to restrict the import of South Korean goods and the country’s cultural influence. According to resource site Gyii.cn, cosmetics exports from South Korea to China grew just 13.7 per cent in 2017, as opposed to 87.3 per cent in 2010. China was still the largest buyer of South Korea’s cosmetics products in 2019, accounting for 65.6 per cent of outbound shipments of locally produced cosmetics, but Chinese customers are becoming increasingly demanding and aware of alternative options. Many Korean cosmetics brands sit in the middle- and low-end price categories and have become popular for “fast beauty”: shortening the R&D cycle to just four months, while the development of most global beauty brands usually takes more than a year. While this approach, akin to fast fashion, gives customers the opportunity to access new products all the time, it has also weighted on the level of innovation and differentiation that these products offer. “[Innisfree, The Face Shop] and Skin Food all have the same characteristics: natural, healthy and affordable products. Regardless of the blessings of the Korean Wave, these brands are too homogeneous,” says Kathy Liang, a former buyer at a Korean cross-border e-commerce platform. In 2018, The Face Shop withdrew from its offline locations in China, but products from the brand are still available on Tmall. Earlier this year, Innisfree announced it would close at least 90 stores in China that were operating at a loss, having already closed 40 last year. Logistics and costs also slow down the arrival of new products on the Chinese market, encouraging Chinese consumers to buy through surrogate shoppers that travel between China and South Korea regularly, rather than go to Korean stores in China. A direct impact of the lack of originality is that some South Korean beauty products are easy and cheap to counterfeit, with fake goods proliferating on the Chinese market and further destabilising consumer confidence. In 2019, South Korean Nature Republic sued up to 60 cosmetics companies at once for using its brand name and infringing Nature Republic’s intellectual property. By Vogue Business Data & Insights Team By Laure Guilbault By Vogue Business Data & Insights Team K-beauty brand Etude House used K-drama stars and product placement for exposure in the 1990s and 2000s. Liang also believes that Korean brands focus too much on marketing specific products rather than building the brand itself, penalising the overall operation. “When you think of JM, you think of skincare masks; Nature Republic makes you think of aloe vera; and Banila makes you think of makeup remover,” she says. “As for other products by these brands, consumers don’t know them, so they rarely buy whole sets.” According to Kantar, in 2015 door-to-door sales and department stores were still the main sales channels for cosmetics sales in South Korea. Pharmacies and single-brand stores were the fastest-growing channels in 2014 and 2015. The situation is very different in China, where in 2015 the transaction amount of Tmall's “Double 11” shopping festival was RMB 91.2 billion (around $12.85 billion), of which 68 per cent was via mobile. This discrepancy has made it difficult for South Korean beauty brands to keep up with the development of China’s e-commerce. “K-beauty’s primary sales channels are offline,” says Du Ke, vice president and senior investor of iResearch. “Consumers' loyalty to makeup is relatively low, and online diversions aggravate the loss of cosmetics consumption in-store.” He believes that those South Korean brands that have not yet grasped China’s online marketing trend will gradually withdraw from the market. By Vogue Business Data & Insights Team By Laure Guilbault By Vogue Business Data & Insights Team New competition is part of the challenge and China’s old and new domestic brands have become more innovative and savvy. For example, in early 2019 89-year-old Chinese skincare brand Pechoin collaborated with popular tea drink chain Hey Tea to create a “Food + Beauty” crossover product to directly target Chinese youth. Florasis, which was founded in 2017, is focusing on the regained popularity of “Chinese style” in its product design and marketing. It also signed top live-stream host Li Jiaqi to promote the brand, simultaneously gaining an endorsement for its brand image and opening a live-stream sales channel. At the same time, Chinese manufacturers that used to operate as OEM (original equipment manufacturers) for foreign brands have now established their own brands, communicating with consumers directly online and targeting the preferences of the new generation of consumers. Domestic cosmetics brands such as Judydoll, Girlcult and Chioture, all of which appeared on the scene around 2018, have made a name for themselves with consumers born after 1995 through fast product updates and low prices. They also bypass the traditional advertising model of signing star spokespeople to cooperate instead with a small number of cosmetics bloggers. According to Tencent's Insight Report on Domestic Cosmetics, domestic brands accounted for 56 per cent of the market share in 2019, and 42 per cent of consumers are more willing to choose domestic beauty brands. Moreover, 90 per cent of consumers that had bought cosmetics from domestic brands said they would do so again in the future. Although the Korean-style makeup trend in China has faded, it’s certainly worth learning from the conglomerate nature of their business models. Both Amorepacific and LG Household & Health Care built up extensive product offerings, with skincare and cosmetics at the core, extending to body and haircare to hygiene products. To some extent, this offset the negative impact of some of the single brands’ development paths and decreased risk. iResearch’s Du Ke thinks it will be difficult for domestic brands like Perfect Diary and Girlcult to grow to the level of global recognition achieved by brands like L’Oréal and Shiseido. To do so, they should learn from the large corporations that they are trying to get ahead of. “The success of the conglomerates behind big brands is due to the large-scale acquisition of emerging brands and cross-regional operation, establishing a ‘product pyramid’ structure,” she says. “Whether or not [China] will eventually produce a cosmetics brand known the world round will rely on a host of other factors: per capita GDP, capital promotion, accumulation of quality and brand renewal and restructuring. This is the path a brand must follow.” To receive the Vogue Business newsletter, sign up here. Comments, questions or feedback? Email us at feedback@voguebusiness.com. More on this topic: Fashion’s struggle with Chinese writing Brands eye China’s virtual idols Decoding China’s Hanfu revival Sign up to our newsletter for a truly global perspective on the fashion industry Enter your email to receive editorial updates, special offers and breaking news alerts from Vogue Business. You can unsubscribe at any time. Please see our privacy policy for more information. By Vogue Business Team By Jessica Schiffer By Kati Chitrakorn By Sirin Kale © 2023 Condé Nast ",
    "datetime": "2020-07-15T04:50:00.000Z",
    "url": "https://www.voguebusiness.com/beauty/why-k-beauty-is-losing-its-lustre-in-china"
}