{
    "title": "Why Makeup Spatulas Are K-Beauty's Next Big Product  | Allure",
    "text": "By Devon Abelman All products featured on Allure are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission. When I first heard the term \"makeup spatula,\" I was sitting down with makeup artists from Jennyhouse, a beloved full-service beauty salon in Seoul, South Korea, in 2019. Fast-forward, and makeup spatulas are 2022's biggest K-beauty foundation application trend. But let's rewind. Back then, makeup artist Hyemin Jo told me that most of her work is focused on creating super smooth, glassy skin that looks as natural as possible on her clients, like actor Song Jihyo. To do so, she uses a super thin layer of the smallest amount of foundation. Of course, I had to ask what tools she uses. A brush? Sponge? Nope. \"A spatula, then a sponge,\" Jo revealed. While I processed this information, Jo brought up a picture of what the stainless steel spatula looks like. It reminded me more of a metal painting knife that Bob Ross would reach for rather than something you'd flip a pancake with. It looks like the bluntest, non-serrated butter knife in your utensil drawer. Jo went on to say she uses it to spread foundation evenly onto skin before blending it out with a sponge or brush. Today, makeup spatulas are no longer a tool solely in the kits of professional makeup artists. Thanks to the Piccasso Makeup Spatula, which is now sold (and often sold out) at K-beauty retailer Olive Young, achieving the same sheer, second-skin-like foundation effect is now accessible to everyday makeup lovers in Korea. Plus, TikTok has recently brought the application technique to an international stage. Just recently, creator @jennypysh_ posted a TikTok of herself trying the trend, and her video has already racked up more than 1.1 million views. This content can also be viewed on the site it originates from. Want to know how you can wield a makeup spatula for the most natural-looking foundation ever? Allow me to share the basics of Korean makeup spatulas. Although you can shop the Piccasso Makeup Spatula right now on Olive Young's international website, it's only a matter of time before Sephora and/or Ulta starts selling it — mark my words. Stateside, similar makeup spatulas are hard to find as many are not quite the same shape or length. Some of the closest matches I was able to track down can be found below. You're probably wondering if you could use a silicone mask applicator or a literal butter knife instead. Well, Korean makeup artist Ssin already tested that so you don't have to. Turns out, neither spread foundation as effortlessly and evenly. Also, the right spatula needs to have a longer edge than that of depotting and mixing spatulas that are on the market here in the states. No matter which one you use, makeup spatulas work best with liquid foundations. Giorgio Armani Luminous Silk Foundation is the one of most popular options among pro artists in Korea. Pircilla Pae, a Korean makeup artist based in Los Angeles, is also a fan of Clé De Peau's Radiant Fluid Natural and Matte Foundations for this particular purpose. \"They blend so easily,\" she says. I recommend the Best of Beauty-winning Nars Cosmetics Light Reflecting Foundation for the task. This content can also be viewed on the site it originates from. To achieve the seamless, clean finish, Pae typically uses \"less than a full pump\" of liquid foundation, she tells Allure. She adds it to the back of her hand before drawing the edge of the spatula — not the wide, flat part —  through it. Then, she gently spreads the foundation onto small sections of the face at a time. You can add additional layers to the areas of your face where you desire more coverage. Next, Pae spritzes an old-school foundation wedge with an essence mist, like the Tirtir Glossy Coating Mist or Superegg Kind Atmosphere Biome Mist, before lightly patting out the pigment to blend. Then, you can target places like your undereyes with concealer, if you'd like. Once she's done with the full face, Pae mists the sponge once more and pats it all over the face. \"The skin looks so fresh and glowy,\" she says. Also, because the foundation is spread so thinly, it won't crease or cake throughout the day. Honestly, I wasn't sure if this technique would work with complexions like mine — acne-prone with hormonal breakouts and scarring — but Korean beauty creator Inssi got her makeup done by makeup artist Ham Kyungsik, who worked with Piccasso on its makeup spatula, to prove makeup spatulas work with just about any skin type. It's also most if the tool helps spackle pores for the smoothest foundation finish ever. I don't usually wear foundation because I hate how it feels on my face, but makeup spatulas might just convince me otherwise. Watch this space! By Aliza Kelly By Gabi Thorne By Gabi Thorne Read more about K-beauty trends: This Korean Skin-Care Device Microneedles Your Face Without Needles TikTok Loves K-Beauty Brand Kaja, and Now, So Do I How to Fight Acne, the K-Beauty Way Now, watch K-pop group Stray Kids break down their most iconic music videos: Don't forget to follow Allure on Instagram and Twitter. By signing up, you agree to our User Agreement and Privacy Policy & Cookie Statement. By Sarah Han By Nicola Dall'Asen By Marie Lodi By Dianna Mazzone More from Allure The BEAUTY EXPERT Contact © 2023 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our \n             User Agreement and Privacy Policy and Cookie Statement and \n            Your California Privacy Rights. \n            The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. \n            Ad Choices. ",
    "datetime": "2022-11-13T15:00:00.000Z",
    "url": "https://www.allure.com/story/k-beauty-makeup-spatula"
}