{
    "title": "Why American Women Are Obsessed with Korean Beauty Products - NewBeauty",
    "text": "For years, industry insiders have known that some of the most interesting things in beauty come from Korea. Everything was kept under wraps until the digital revolution allowed for American women to take notice. It all started with BB cream, the single product that put Korean beauty, also known as K-Beauty, on the map. Since then, interest in K-Beauty has piqued. Want to know where it all stemmed from and what’s slated to be the next big thing? We’ve got the story right here. You May Also Like: The Latest Korean Skin Care Trends You Need to Try  K-Beauty is really all about skin care. Skin care is the main focal point and it’s\npresented in a way that makes it more enjoyable and relaxing than a chore.\nHealthy skin is the essence of a beautiful look, and Korean women go above and\nbeyond to get it. Hydration is so major that you will actually see women\nmeasuring their moisture levels with pocket-size moisture-level testing devices\nto keep a pulse on when their skin needs an immediate hydration boost.   Not all products are kitschy. Sure, some K-Beauty products are known for\ntheir cute packaging, but most items are packed with powerful ingredients and\nsolid at reasonable price points.   Korea is the new beauty superforce. Korea is the leader in beauty innovation,\npacing about 10 years ahead of the rest of the world. “Until retailers began\nmaking Korean beauty products accessible in the U.S., American consumers hadn’t\ntaken note of all that was offered over there. Then, the dialogue about Korean\nbeauty rituals, new ingredients and product categories—as well as word-of-mouth\nbuzz from consumers—started to take off,” says Alicia Yoon, founder of Peach & Lily, a K-Beauty e-tailer.   Korean beauty consumers are savvy. According to Charlotte Cho, founder of\nSokoGlam.com, Korean beauty companies are at the forefront because consumers\nare super picky about what they want and are quick to make judgments on\nproducts. “Korean beauty consumers are savvy, so cosmetic companies need to be\non their toes and constantly churn out the best product at the best price. In\nthe Western world, there’s not this same sense of urgency to innovate. For a\nproduct to ‘make it,’ it has to contain awesome ingredients and have\neye-catching packaging so that it really stands out.”   It’s more than a trend. “If it were just one product or trend that were popular, this whole K-Beauty sensation would just be a blip, but it’s not. It’s\nbecome a lifestyle and a mindset,” says Cho.   New products are on the horizon. There are a lot of new things coming out of\nKorea, and one of the newest is splash masks to improve skin texture.\nSplash masks contain botanicals, fruits and lactic acid to retexturize skin.\n“They take the 10-minute facial to a 15-second splash. You get an instant\neffect,” says Christine Chang of GlowRecipe.com. Get it in Blithe Patting Splash Mask ($48).   And, new textures are coming out, too. Products that provide a 4-in-1 multitasking\nbenefit are big, and some, like  Shara Shara Honey Bomb All In One Ampoule ($40) have unique, jelly-like textures, too.  At NewBeauty, we get the most trusted information from the beauty authority delivered right to your inbox Find a NewBeauty \"Top Beauty Doctor\" Near you Get trusted information from the beauty authority delivered right to your inbox ",
    "datetime": "2016-01-11T18:16:45+00:00",
    "url": "https://www.newbeauty.com/why-k-beauty-is-sweeping-the-nation/"
}