{
    "title": "Why dewy skin became an international obsession",
    "text": "“I never knew I wanted to look dewy until social media told me I should look dewy,” a colleague declared recently. Indeed, scroll through Instagram and you’ll be greeted with endless variations of essentially the same luminous #skingoal. There’s “glass skin,” described by Charlotte Cho, founder of the K-beauty retail site Soko Glam, as a “clear, poreless, translucent complexion”; “honey skin”; “cloudless skin”; “yoga skin”; and the highlighter-happy “dewy dumpling” look. It’s a major pivot: For decades, magazines and the beauty industry conditioned women to believe that shine was the enemy, with pressed powder, blotting papers, and mattifying gels their chief weapons in the battle against oil. And just a few years ago, the reigning Instagram aesthetic involved heavy makeup and contouring, a technique popularized by Kim Kardashian West that uses shading to create the impression of sharper cheekbones and more angular features. So how did the lightweight dewy look become de rigueur? The Korean Wave and the ascent of athleisure are just two of the trends that have converged to convince women around the world they need to get that glow. The story of dewy skin’s rise to Insta-fame begins with the same country that introduced the world to joy of boy bands like BTS and EXO: South Korea. With South Korea’s cultural influence on the rise thanks to its wildly popular music and soap operas, its beauty standards have also gained international currency. Central to the current Korean beauty ideal is chok chok: A moist, softly gleaming complexion, achieved through a dedicated skin-care routine. Alicia Yoon, founder of the Korean beauty retail site Peach & Lily, tells Quartz that when she was growing up in South Korea in the 1990s, “the beauty look was a more matte, fluffy, powdery, mochi-skin look.” In the early 2000s, the trend began to shift toward a more dewy finish. “When I spoke to Kowonhye, one of Korea’s top makeup artists, she shared that she was one of the pioneers of that movement,” Yoon writes via email. “She was on set one day doing makeup for a big TV show, and with TV becoming more high-definition, she thought a dewier, more natural finish would look better on screen.” Other makeup artists began to embrace the look, which then trickled down to everyday consumers. Korean beauty companies capitalized on the desire for the dewy look by peddling “skin care as makeup.” The desired glow could be obtained via toners, serums, exfoliants, oils, and moisturizers, along with exercise, plenty of sleep, and a healthy diet. Korean makeup, too, evolved toward products that accentuated the skin’s natural sheen rather than covering it up. Yoon cites BB Cream, “which provides decent coverage but is supposed to look like ‘second skin’ without a powdery foundation,” and “cushion compacts,” which provide similarly light coverage. By the early 2010s, Korean beauty products, already popular in China and other Asian markets, were gaining momentum in the West. Charlotte Cho, founder of the K-beauty site Soko Glam, gave interviews to US women’s magazines that helped popularize a 10-step Korean skin-care routine, while YouTube vlogs, Reddit forums, and Instagram selfies and “shelfies” helped spread the good word about how to get glowy skin, providing enticing photo evidence to boot. The appeal of K-beauty lay not just in the promised results of radiant, chok-chok skin, but in the price point. “Korean skin-care products tended to be more affordable than what one can buy at Sephora while seeming cooler than drugstore products available anywhere,” beauty journalist Tracy E. Robey told Vox’s Alex Abad-Santos. Sephora itself jumped on the bandwagon; by 2011, it was selling K-beauty products, too. The dewy look—and the K-beauty products that promise to confer it—has been unstoppable ever since. Target and CVS stores each launched dedicated K-beauty sections in 2017, both curated by Peach & Lily’s Yoon. In 2018, Korean cosmetics exports totaled $6.3 billion, according to the latest government data, an annual jump of 27% and the seventh straight year of double-digit growth. Western brands have also gotten in on the action, with plenty of skin-care and cosmetic products designed to help consumers achieve their desired level of glow. There are no less than 255 highlighting products on Sephora’s site, including options from Marc Jacobs, Nars, Dior, Benefit, and Fenty Beauty by Rihanna. Perhaps the single most-influential Western company when it comes to the dewy-skin trend is the minimalist beauty brand Glossier. Founded in 2014 by Emily Weiss, a former Vogue assistant and beauty blogger, Glossier has achieved a valuation of $1.2 billion in large part thanks to savvy social-media marketing with an explicit focus on “glowy, dewy skin.” As the company’s name suggests, Glossier’s products—and vocabulary—seem to emerge from the founding principle that women’s faces should reflect more light than a solar panel. Peruse its makeup and skin-care pages, and you’ll find “glassy lip gloss,” “dew effect highlighter,” “glistening eye glow,” “super glow” serum and body creams that promise “glowy, dewy hydration.” A 2018 profile of Weiss in New York magazine took Glossier’s dewiness obsession to its logical conclusion, featuring photos of the founder looking drenched and so shiny that her cheekbones look likely to cause glare. As Autumn Whitefield-Madrano, author of Face Value: The Hidden Ways Beauty Shapes Women’s Lives, tells Quartz, it makes sense that Glossier swept the millennial and Gen Z markets just as the contouring trend—with its complicated shading methods and layers of makeup—reached its Instagrammable peak. A glowing aesthetic was the perfect counter to what Whitefield-Madrano calls the “programmed and stylized and unachievable,” heavily-made-up beauty trends that played to the camera and looked theatrical in daylight. Indeed, contouring has long been associated with performance; actors in Elizabethan England smeared chalk and soot on their face. Just as young people got fed up with Instagrammers who produce perfectly arranged, color-coordinated grids and clearly staged shots, so too did the cultural pendulum swing toward looks that appeared less affected. As New York magazine notes, Glossier is sometimes described as “makeup for people who are already pretty.” That’s not necessarily a criticism. The idea of using makeup to accentuate one’s features, rather than transform them, is central to its appeal. The Glossier aesthetic looks good on Instagram, sure, but no one looks like they’re trying too hard. The gleam on the tip of a Glossier fan’s nose could be Haloscope, or simply a trick of the light. There’s also a connection to be drawn to the rise of athleisure. A slightly shiny complexion is as much a fashion statement as a pair of color-blocked Outdoor Voices leggings. Both communicate that fitness has been so well-integrated into your lifestyle that you always appear to be on your way back from barre class. “Shininess implies radiance and health and inner vitality,” Whitefield-Madrano observes. “It is sort of weird that matte has been the standard for so long. Matte implies that you’re not moving.” For a long time, sitting still and not moving was a sign of privilege, while breaking a sweat was for the plebes. It’s only in the past few decades that exercise has acquired the glow of righteousness, tied up, as Jia Tolentino writes in an essay on Outdoor Voices for The New Yorker, with one’s ability to “compete in a culture of escalating beauty expectations and increasingly boundless work.” Yoon notes, “I do think in the US, a rising awareness of wellness and how to do self-care the right way leads to conversations about how to care for skin and ultimately, hydration, which often times can translate to dewy skin, comes up as that’s such a foundational pillar for skin health.” And because people who have the time, energy, and ability to prioritize exercise tend to lead privileged lifestyles, glowing skin that speaks of your commitment to wellness culture may be the ultimate status symbol. Dewy skin, in essence, is a sign that you’re doing a lot of other things right, too: Exercising at least three times a week and drinking eight glasses of water a day and eating your lean proteins and vegetables and wearing sunscreen and avoiding alcohol and going to bed early and maybe seeing a dermatologist and getting facials. A dewy person is a healthy person. Dew communicates, much like the Lululemons that Moira Weigel writes about in a recent essay for Real Life Magazine, that you’re “engaging in constant self-management.” If you’re disciplined enough, everyone will be able to see how good you’ve been; your inner glow will be made manifest. Further buoying the dewy-skin trend is a cultural backlash against the term “anti-aging,” as Morwenna Ferrier writes in The Guardian. Some women’s magazines, including Allure and Elle, have banned the phrase from their pages. Allure editor-in-chief Michelle Lee explains that, given the inevitability of mortality for all living creatures, she objects to the idea that “aging is a condition we need to battle.” At the same time, brands like Kiehl’s began avoiding language about fine lines and wrinkles in favor of euphemisms like “radiance.” This evolution is particularly pronounced in newer brands that target millennials. Vox’s Cheryl Wischhover points to two Vitamin C products—Drunk Elephant’s C Firma and Skinceuticals CE Ferulic—that contain similar active ingredients, but use markedly different language in their branding. Skinceuticals mentions “aging” or “anti-aging” 15 times on its website; the Drunk Elephant page on Sephora omits such concerns entirely, focusing instead on “radiance” and “luminosity.” As Wischhover explains, putting people on a quest for dewy skin is a way for the beauty industry to soften ageist rhetoric while keeping the underlying youthful ideal intact. While changing the language around aging isn’t the same thing as accepting wrinkles, Whitefield-Madrano says that’s an improvement: “If you’re going to be buying this stuff anyway, I would rather buy something that has positive connotation than a negative one.” In a recent article for The New York Times, Euny Hong, author of The Birth of Korean Cool, suggested that the Western fascination with Korean skin care has a tinge of Orientalism to it, noting that the luxury brand Sulwhasoo “advertises its products as containing “Korean herbal medicine drawn from Asian wisdom.” That’s a fair assessment. Yet the rise of K-beauty and the dewy-skin look can also be attributed to the close scrutiny to which all women’s faces are subjected. Women live in a world that’s at once eager to scan their faces for wrinkles, acne, redness, freckles, scars, dry patches, and other signs of humanity, and ferociously critical of makeup that conceals or minimizes the features they’re told are flaws. In this sense, the dewy look may be the ultimate armor for women. It feeds into the perennial dream of no-makeup makeup, which allows the wearer to present a natural-looking yet enviably flawless front to the world—or better yet, a face so immaculate and reflective of one’s inner goodness that there is nothing to feel ashamed of or conceal. It’s fitting that many of the terms for dewy skin—“glass skin,” “honey skin”—aspire to mimic surfaces that are smooth and glossy and poreless, and not really much like skin at all. Our free, fast, and fun briefing on the global economy, delivered every weekday morning.  ",
    "datetime": "2019-07-24T11:30:26.598Z",
    "url": "https://qz.com/quartzy/1673214/why-dewy-skin-became-an-international-obsession"
}