{
    "title": "Why eye bags are the latest beauty trend | Stuff.co.nz",
    "text": "South Korea has the beauty game on lock, and their latest trend will turn your view on eye makeup upside down. You know those pesky under-eye bags you've waged war on since the first time you broke curfew? The ones you've tried to smother away with cucumbers, concealers, foundations and coffee-infused eye serums? Well, in Korea, women haven't only stopped concealing them, but have started accentuating them. They call it 'aegyo-sal', which roughly translates to 'eye smiles' or 'cute, charming and winsome baby-eye fat'. Those Koreans, they think of everything. Jessica Alba and Beyonce each have a pretty pair, as does every K-pop and J-pop celebrity, both male and female. There's even a K-Pop Eye Bag Appreciation club online. (Check out this freaky chart of singers with and without it.) These aren't our personal brand of bruise-hued zombie/Tim Burton eye bags they're coveting, but the puffy pocket of pudge directly underneath your lash line. The difference is in the location. You see, fatty 'aegyo-sal' apparently make you look cute and young, the blue-toned dark circles caused by sleep deprivation just make you look old and misses the point entirely. Do you see the distinction? According to Korean beauty bloggers, defining and adding depth to this area creates the illusion of more intense, rounder eyes. Accentuating 'aegyo-sal' essentially creates a more hollowed-out eye socket, a look most popular with East Asian women who were born with relatively flat and smooth faces. Weren't blessed with under-eye pouches? Thanks to the money-spinning beauty industry, there are plenty of options for faking it! In Asia, you can buy strips of sticky tape that make the skin beneath the eye 'pop' out. (Surely if this comes loose, it'll look even more disastrous than your eyelash strips ungluing?) There are eye plumpers, such as TonyMoly's Petit Fuller Eye Plumper, which we're told is less irritating than it sounds. The tube only contains hydrating ingredients and is nothing like the pout-inflaming plumpers currently on the market. Etude House has gone so far as to create an aegyo-sal-specific tool. Dear Girls Cute Eyes Maker (yes, that's it's actual name) features two cushiony applicators – one that's soft brown to create the illusion of shadow and one that's shimmery pink to let your 'pudge' catch the light.  Women in Korea are also turning to cosmetic surgery to create 'aegyo-sal', taking fat tissue from their abdomens, thighs or hips and injecting it under-eye to create more volume. There's even a two-in-one procedure that removes under-eye bags, while adding a cute 'puff' immediately beneath it. Those playing at home can otherwise improvise using a matte brown eyeshadow a couple of shades darker than your skin and a highlighter (and if you don't own highlighter, that frosty pink lipstick that lives in your bottom drawer). Start by evening out your skin tone with BB cream (what's a Korean-inspired beauty tutorial without BB cream?) before applying the brown shadow and blending. (Sure, you will feel downright ridiculous drawing a dark circle over the dark circles you just attempted to cover up, but South Korean beauty is always crammed with seemingly unnecessary steps.) Once it's blended, go over with the shimmery highlighter to contour and accentuate the shape. The rest of your eye makeup should be kept pretty basic. The trend in Korea is to pair them with 'puppy eyes', a downward version of the classic cat-eye flick. Honestly, a permanent smize by way of aegyo-sal has never been a look we've aimed for, but if it takes us one step closer to our dream of becoming a K-pop superstar, then who are we to argue? And just between you and me, there's also this genius method for achieving the look that won't cost you a cent called 'sleep less, smile more'. You can't bottle that. Head to our Facebook page for more from Stuff Life & Style dailylife.com.au © 2023 Stuff Limited ",
    "datetime": "2015-03-13T00:07:19.717Z",
    "url": "https://www.stuff.co.nz/life-style/beauty/67325867/why-eye-bags-are-the-latest-beauty-trend"
}