{
    "title": "Why a Korean Exfoliating Mitt Is the World’s Best Exfoliator | Vogue",
    "text": "To revist this article, visit My Profile, then View saved stories. To revist this article, visit My Profile, then View saved stories. To revist this article, visit My Profile, then View saved stories. By Monica Kim All products featured on Vogue are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission. Before there was BB cream or cushion compacts, before the 10-step skin-care routine swept the country, Koreans were mad about exfoliation. So while others may turn to fine terry-cloth wands and high-tech sonic cleansing devices to shed their winter skin, my mind has called up the Korean washcloth, a simple exfoliating mitt that does the trick at 80 cents a pop. Made from pure viscose, with four telltale black stripes running along the seams, the ultra-abrasive cloths are a staple at Korean spas, or jjimjilbang. There, you can pay for some 20 minutes of torture, as a bath attendant sloughs the dead skin off your body, removing ddae—the Korean word for dirt or grime—and exposing the raw pink layer beneath. Or you can shell out $5 to buy a pack for your home and render your skin baby soft anytime. Ask any young Korean (including this one), and you’ll no doubt hear how much she once hated those towels. To this day, there is a particular shade of electric green that gives me chills, conjuring memories of sitting in the tub while my mother sandpapered the skin off my arms. “See how clean it is?” she would say, pointing at the pilling dirt and dead cells, only adding to my horror. Yet we do come to adore them. It’s an intense treatment that takes time to grow into—one that’s gained a cult following at Korean spas—and is increasingly available stateside, turning up in the form of Dermasuri’s mitt or in bulk on Amazon. It took two decades, but I’ve finally come to appreciate the brutal simplicity of the Korean washcloth—especially when repairing my legs after a long, dry winter. A few tips to consider: Scrub only after a long soak, which softens the skin, then wet the mitt and apply a soothing soap. Green mitts are the standard, while other cloth colors come in varying degrees of strength, pink being the softest and blue being the most abrasive. Exfoliate your body just once a week, at most, and avoid the face. Above all, please spare the children. Eventually, they’ll come around.  Korean Italy Towel Korean exfoliating bath washcloth AMAZON By signing up you agree to our User Agreement and Privacy Policy & Cookie Statement. By Kiana Murden By Kiana Murden By Kiana Murden By Twiggy Jalloh By Kiana Murden By Hannah Jackson More from Vogue See More Stories © 2023 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Vogue may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad Choices CN Fashion & Beauty ",
    "datetime": "2016-04-18T16:43:24.000Z",
    "url": "https://www.vogue.com/article/korean-exfoliating-wash-cloth-mitt-dermasuri"
}