{
    "title": "Why bamboo is one of the hottest ingredients in Korean beauty products | Life-style News - The Indian Express",
    "text": "Bamboo is an easy-to-grow, very fast-growing and renewable plant. It is said to be very versatile and has numerous uses. To name a few, it is used to make clothes, in food, fuel, construction, home decor etc. “Cultivation of bamboo doesn’t require pesticides, and once it grows, it can reduce up to 35 per cent of the carbon dioxide in our climate. Knowing that bamboo is good for our environment should make us feel pretty good about applying extract from it to our skin,” explains Mini Sood Banerjee, Assistant Director, Innisfree India. She adds, “Together with all the anti-acne, astringent properties and with the antioxidants and silica content it is said to be the powerhouse ingredient in skincare products.” Bamboo is becoming a key ingredient in skincare products, especially in the K-beauty range because it has a lot of benefits. The following are the skin benefits that bamboo provides: It makes your skin radiant and supple Bamboo is said to be rich in silica content, which gives your skin a radiant glow. It is also said to have hydration benefits, besides silica also produces collagen that results in firmer skin and a youthful bounce. When used regularly, a product with bamboo as an ingredient can leave your skin smoother and more supple. Strengthens the skin Bamboo extract can leave the skin with perfect strength and firmness, which makes it perfect for acne-prone skin. Acne damages the outermost layer of the skin which protects it from bacteria and environmental pollutants. Bamboo strengthens this barrier and restores the outer layer, thus making it easier to fight acne. Great for drawing impurities from the skin Bamboo is said to have great purifying and detoxifying properties. Thus, it helps the skin to get rid of impurities. Rich in many essential compounds Bamboo extract is rich in compounds like amino acids, flavonoids which are antioxidants that protect skin from oxidative stress. These compounds are essential in skincare for shielding from UV rays Protects your skin from free radicals Bamboo extract is a powerful antioxidant, which keeps your skin safe from damaging free radicals. It also diminishes fine lines and keeps your skin comparatively supple and moisturised.  ",
    "datetime": "2020-03-27T21:40:19+05:30",
    "url": "https://indianexpress.com/article/lifestyle/life-style/korean-skincare-beauty-benefits-of-bamboo-6334736/"
}