{
    "title": "Why the Korean Beauty World Is Going Natural, and Why You Should Too",
    "text": "Korean beauty guru Sarah Lee on why switching to a natural skincare routine will change your life. Growing up between Korea and Hong Kong, Glow Recipe founder Sarah Lee got a crash course in skincare way earlier than most of us did. “I’ve eaten, slept and breathed beauty my entire life,” the Korean beauty guru explained. So in 2014, Lee and her partner Christine Chang left their marketing posts at L’Oreal, and started Glow Recipe, an impeccably curated site which finally makes natural Korean beauty brands available to the global market. “Our goal is to be a worry-free site where customers know they are shopping vetted products,” Lee explained. And it comes just at the right time. With words like “safe,” “non-toxic,” and “natural” being thrown around in the skincare world, it’s hard to discern which products are actually safe. So Lee did the work for us, vetting the best natural K-beauty products that are free of parabens, synthetic fragrances, silicones, and nasty foaming agents, meaning you no longer have to fly fourteen hours to get coveted brands such as Whamisa, Yuri Pibu, and J. One. Here, Lee gives us the rundown on everything we need to know about the current state of natural Korean skincare–from three of the newest (and weirdest) effective ingredients, to why fermented products will change your skin. Sarah Lee of Glow Recipe Korean Beauty was always focused on effectiveness, without too much consideration for being natural. What do you think spurred this shift in South Korea towards more organic and natural products? Korean consumers are being educated on the importance of high quality ingredients every day, and there is a strong belief that with natural skincare, you no longer need to compromise on results. The natural skincare technology has advanced tremendously. One great example is an app in Korea called HwaHae, where licensed beauty experts provide audits for every major product, with detailed data on ingredients, the safety level, and aggregation of consumer reviews–think of it as Wikipedia or Yelp for K-beauty. The app has become influential enough to drive companies to change formulations to cleaner, more natural ones. This app is actually considered the first tool you use when deciding whether to make a purchase. You can bet brands are paying attention to what people say on this app. What trends do you see? One huge trend that I’m seeing from Korea is “visibly natural skincare,” which refers to products that typically have a single hero ingredient and use color strategically and transparently in its packaging and formulation to highlight the high concentration and inherent value of that hero ingredient. An example is an antioxidant-packed overnight mask with the midnight hue of its key ingredients black currant and black cumin. Can you name a few key Korean brands that lead the way in natural skincare, but are also effective? Whamisa, Blithe, and Belif. Whamisa pioneered fermentation technology for skincare in Korea, and is our #1 brand on GlowRecipe.com. They are also Eco-cert, BDIH certified, and have some of the cleanest and most powerful natural ingredients I’ve ever seen. Whamisa’s top seller is the Deep Rich Essence Toner, that has sold out 6 times in 6 weeks on our site beginning of this year, and is my all-time favorite toner. Blithe is the first skincare line that focuses on anti-polluaging (pollution + aging) with some of the most innovative mult-taskers and new textures. The Tundra Chaga Pressed Serum was featured on ABC’s Shark Tank, and sold out in a few minutes during our first K-beauty live show on QVC. It’s a truly natural product with concentrated Chaga mushroom extracts, that consist over 60% in the entire formula – providing ultra hydrating and nourishing results, while firming and line-diminishing as well. Belif focuses on combining centuries old apothecary and modern Korean skin science, and their aqua bomb is incredibly popular for its powerfully hydrating result. You are so ahead of the curve–you started Glow Recipe before Korea caught on. What spurred this interest? Our goal was and still is to be a worry-free site where customers know they are shopping vetted products, brands and companies. Imagine a Venn diagram with Korean beauty in one circle, and “natural” skincare products in the other. We sit squarely in the intersection of these two concepts. Korean beauty is known for their 10-step beauty routines. Do you no longer think this is necessary? We’ve all heard of the infamous 10-step K-beauty routine. Now, while there may be a sliver of truth, the reality is that few, if any, busy women and men in Korea actually use 10 steps–in fact I would go as far as to characterize it as a marketer’s myth. The modern Korean seeks efficacy and efficiency. As a result, we’re seeing more hybrid products that are designed to pull double or triple duty, such as in-shower treatments that exfoliate, hydrate and tone, and multitasking priming moisturizers. What are the newest and most unusual ‘natural’ ingredients that are being used on the market? Cactus, artichoke, and black truffle. Wearing her hair in a sleek, curled high pony, model Nina Agdal is all smiles with creamy, luminous skin. Victoria’s Secret Angel Sara Sampaio bares her natural beauty with tousled locks, a nude pink lip and luminous skin. Rocking the ultimate “J.Lo glow”, Jennifer Lopez wears a high pony with long, polished locks paired with a dark smoky eye. Pop star Selena Gomez shows off her luminous look created by makeup artist Hung Vanngo with a metallic pink smoky eye and a glossy coral lip. Model Bella Hadid poses wearing a sleek top knot with perfectly dewy, luminous skin and a mauve lip. Model Ashley Graham looks beachy with her natural waves, a sheer coral lip and dewy, sun-kissed skin. Actress Kate Bosworth glows as she wears her hair in a sleek low pony  with sun-kissed, luminous skin and a glossy coral lip. Model Hailey Baldwin pairs her luminous skin with a magenta smoky eye and a sleek, middle-parted low bun. Supermodel Rosie Huntington-Whiteley pairs her sleek, side-parted bun with a grey smoky eye, glossy pink lips and perfectly dewy skin. Big Little Lies actress Zoe Kravitz shows off her new blonde pixie and naturally radiant skin with a nude pink lip. What is the most convincing reason one should change from normal to natural and organic products? Two words: no compromise. It’s the best way to approach your skin with a gentle care, while expecting a powerfully effective result. You shouldn’t compromise on the approach or the result. Are natural products as effective? They certainly can be, if executed with advanced technology, such as fermentation, or water-free formulations. Fermented skincare ingredients are those that have been through a lacto-fermentation process. Lacto-fermentation is an anaerobic (free of oxygen) process that uses a probiotic called lactobacillus to break down the sugars and proteins in organic matter over a period of time, converting those sugars and proteins into lactic acid. As the fermentation environment acidifies, bacteria and harmful microbes die off, and the ingredients break down into smaller, nutrient-dense constituents, which also allows desirable by-products such as amino acids and peptides to emerge. The end result is a preserved, concentrated, more nourishing version of the original ingredient, which can now be better utilized by the skin. What is your number one miracle product? The J.One Jelly pack – it is the ultimate foundation glue, that hydrates and firms the skin, but also grips makeup for a perfectly natural and flawless complexion that lasts all day. I truly think it’s a miraculous product and has transformed many faces, that were sick of cakey makeup, or foundation that faded away a few hours after application. Why do you think Korea is famous for leading the way in skincare? Innovative, new products and concepts that disrupt a saturated beauty market – BB Cream, is one example as are sheet masks for a 20 minute at home facial, multi-tasking pressed serums, fermented skincare, rubber masks that deep cleanse without irritation, splash masks for a 15 second mask in the shower. In the past, France was considered the global leader in beauty, but now all eyes are on Korea. Korean beauty products are the #1 multicultural beauty search term in Google for example. Cosmetic experts look to Korean products and manufacturers for inspiration. And the country is equally innovative when it comes to business: Brands churn out new launches every 6 weeks with creative concepts and formulas. They have the fastest innovation cycle in the world. If you could use any two products for the rest of your life, what would they be and why? Whamisa Deep Rich Essence Toner.  This hydrating toner is my holy grail; it’s a uniquely bouncy, cushiony, and slippery texture and is formulated with Aloe Vera extract, Chrysanthemum extract and Oat Kernel to moisturize and nourish skin instantly and over time. It’s beautifully crafted with a  97.5% organic formula and also includes fermented Dandelion and Argan Oil to improve skin texture and leave skin dewy and deeply rehydrated, especially when used in the 7 Skin Method. Second, Glow Recipe’s new Watermelon Glow Sleeping Mask. It’s always been my dream to wake up to glowing, renewed skin, and we worked really hard to develop a lightweight gel-type mask that gives you an overnight facial, with hyaluronic acid, AHA, and watermelon. We will be launching very soon, mid-May on our site, and early June in all Sephora stores. What advice would you give to twenty and thirty-somethings looking to take care of their skin? Focus on prevention versus repair, and think of skincare as self-respect. If you respect your skin now, it will respect you back and reward you with a beautiful complexion. Also, have fun with it. We coined the term “Skintertainment.” With the right product, your beauty routine should be a little slice of sunshine in your day. Pampering your skin and yourself should be enjoyable and fun–not a chore. Related: Watch W’s most popular videos, here. The dry shampoo adverse finally have their formula—the mousse leaves no white residue, and gives a touch of shine. Because clean hair doesn’t have to be matte. Ouai Dry Shampoo Foam, $28, theouai.com That J.Lo glow starts with proper physical and chemical exfoliation. The apricot seeds tackle the former, while the citrus extracts give the chemical kick. Dior Hydra Life Glow Better Fresh Jelly Mask, $69, sephora.com The famed P50 exfoliating lotion’s newest flavor targets pigment by regulating melanin production. You know, the spots that started appearing once you hit 25? Biologique Recherche Lotion P50 PIGM 400, $66, biologique-recherche.com 25 percent alpha hydroxy acid is no small dose, but Drunk Elephant managed to make it gentle enough for the most sensitive of mugs. The glowing result is worth gloating about. Drunk Elephant T.L.C Sukari Babyfacial, $80, sephora.com Talk about a brush with greatness! This TSA friendly baby is easier to apply than a solid cameo, and more fun too. Plus, the synthetic bristles are animal-friendly and won’t cause irritation. Byredo Gypsy Water Kabuki Perfume, $65, available in May at byredo.com When you want the ease of a spray with the control of a lotion, mousse is the word. The fast-absorbing formula will save your best threads from sunscreen stains too. Supergoop! Super Power Sunscreen Mousse Broad Spectrum SPF 50, $34, available in April at sephora.com Shine and texture come together for the ultimate all-in-one product. Like we said: shiny hair is in, matte is out. R+Co TROPHY Shine Texture Spray, $29, neimanmarcus.com Most setting mists actually disrupt makeup, which is why makeup artist Hung Vanngo is so excited about this one. The spray is so fine that is does its job, without making his any harder. Marc Jacobs Perfecting Coconut Setting Mist, $39, available in April at sephora.com Most salt scrubs are too rough for the scalp, and come as added step to a normal hair care routine, which is why founder Nancy Twine looked to skincare in developing this incredible 2-in-1. The charcoal draws out impurities to keep the scalp and hair follicles health, while coconut oil hydrates the ends. Briogeo Scalp Revival Shampoo,$42, available in April at briogeohair.com A shower head that latches to close? Mold gets trapped in traditional styles, which makes for a moldy shower is not only problematic for skin and hair, but for your health too. Shower Clear unhooks between use to keep it clean. Shower Clear The Original Chrome Shower Head, $275, shopshowerclear.com ",
    "datetime": null,
    "url": "https://www.wmagazine.com/story/korean-beauty-glow-recipe-sarah-lee"
}