{
    "title": "Why Chimamanda Ngozi Adichie's Beauty Campaign Matters",
    "text": "Every item on this page was chosen by an ELLE editor. We may earn commission on some of the items you choose to buy. It was announced today that celebrated author, feminist, and aesthete Chimamanda Ngozi Adichie is the face of British brand Boots' new beauty campaign. The campaign launches today, and according to Huffington Post UK it will include print, digital, and TV components. But it is much more than that. Adichie's new gig is a statement that real women, serious women—the kind who write critically acclaimed novels and give TED Talks with outsize effects on politics and pop culture—also care about beauty and fashion. And Adichie is as serious as a woman can get. She is a MacArthur \"genius grant\" recipient, the author of the critically acclaimed novels Americanah and Half of a Yellow Sun. Her seminal meditation on feminism, \"We Should All Be Feminists,\" was not only sampled by Beyoncé, but is now required reading for every 16-year-old boy in Sweden. As a woman who writes about white supremacy and police brutality as well as summer fur and beauty products, it's empowering to see Adichie dismantle the double standards that deny the complexity (which is to say, the humanity) of womanhood. I need to see that a woman, a Black woman, can shift global political thinking and sit front-row at Dior as both a guest and muse, as she did a few weeks ago in Paris. Still, a writer? The star of a beauty campaign? Writers can be egregious offenders of glamour. After all, we are known to spend days on end in sweats, tapping away at a keyboard, and surviving on Special K. No one says it, but it's understood that if you are a woman who wants to write about Serious Things and Be Taken Seriously, you should not look like you take yourself too seriously. In a 2014 essay for ELLE, Adichie, who grew up in Nigeria, makes the following observation about studying at an American university: \"For serious women writers in particular, it was better not to dress well at all...if you spoke of fashion, it had to be either with apology or with the slightest of sneers.\" Serious male writers are given permission to love comic books and video games. Hell, some of them even make second careers doing it. So to watch Adichie publicly take pleasure in aesthetics and to be celebrated for it is a hopeful shift. Beauty is political. As the photographer Joel-Peter Witkin wrote, \"Beauty is each culture's peculiar fiction.\" The dangerous fiction that our culture peddles is that dark women, largely, can't be seen as beautiful. What our culture upholds as beautiful, if we're to judge by looking at the runway, mainstream media, and advertising, is predominantly white, thin, and young. So it's political that one of the biggest British brands has tapped a dark-skinned Black woman writer who writes about feminism, colonialism, and Nigeria to represent them. Colorism often excludes Black women who aren't mixed-race or mixed-race-passing from being considered as beautiful. In recent years, against the backdrop of the galvanizing spirit of Black Lives Matter, we have seen the world rushing to diversify and be more inclusive. But to see the identities and politics that Adichie represents celebrated in mainstream ways is still going to be peculiar, to use Pitkin's word, for most people. But this \"novelty\"―that serious Black women writers can't indulge in or write about fashion and beauty―must be normalized. In her essay \"We Should All Be Feminists,\" Adichie writes: \"I like politics and history and am happiest when having a good argument about ideas. I am girly. I am happily girly. I like high heels and trying on lipsticks.... I wear them because I like them and because I feel good in them.\" Me too, girl. And I'm done having to choose. And Adichie's current Glow Up in no way takes appreciation away from her sartorially savvy fellow writer, Zadie Smith. The writer, who has been known to stun in Altuzarra, Proenza Schouler, and head wraps that will one day singularly inspire a runway collection, is also deeply passionate about fashion. She, too, is a cover girl; Smith can be found on one of seven of T magazine's \"The Greats\" issues. So often, when we are trying to find language around a new idea, we do the very thing that we are trying to escape. We pit women against each other. Instead of expanding what womanhood looks like, we unwittingly replace one standard with another. In the quest for fullness, we constrict women. We fail to remember that we are fighting for representation of all forms of womanhood, not just those versions that have been allowed. We cower to old habits instead of rising to imagination. To write this piece, I felt it was only right to slip out of my sweats and into something befitting not only of Adichie's style, but also of my own. I wrote this essay in a starched white Oxford, a pair of my grandmother's Chanel earrings, and lips coated in my favorite brick color. I see Adichie's refusal to succumb to sloppiness or other people's expectations as weaponized glamour—using beauty and style in direct, political ways that subvert dehumanizing expectations. It's a form of protection. There is a tremendous confidence in facing a hostile world with a good outfit. Simple Nail Designs for Your Manicure Mood Board 14 Vanilla Perfumes That Smell Absolutely Amazing 13 Best Japanese Skin Care Products to Shop For Breast Cancer, 40 Is the New 50 Meet YSL Beauty’s Most Unconventional Scent Yet Amazon Is Having a Major Beauty Sale Right Now Why Matrix Could Be the Next Best Skin Treatment The Best Neutral Nail Colors for Every Skin Tone Claudia Sulewski Launches CYKLAR Beyoncé Is Finally Releasing a Perfume A No-Damage Routine for Colored Hair First Class Beauty 2023 A Part of Hearst Digital Media We may earn commission from links on this page, but we only recommend products we back. ©2023 Hearst Magazine Media, Inc. All Rights Reserved. ",
    "datetime": "2016-10-21T15:12:00Z",
    "url": "https://www.elle.com/beauty/news/a40177/chimamanda-ngozi-adichie-boots-beauty-campaign-why-it-matters/"
}