{
    "title": "Why slugging is the new Korean beauty trend everyone is talking about | Vogue India",
    "text": "To revisit this article, visit My Profile, then View saved stories To revisit this article, visit My Profile, then View saved stories By Hasina Jeelani In the world of skincare, K-beauty is the gift that keeps on giving. While some practices, such as double-cleansing, have become a mainstay in our skincare routines, others, like slapping your face for a youthful glow, can take some getting used to. Clocking in somewhere between the two ends of the spectrum comes a fresh K-beauty trend, tried and tested by the masses of Reddit—slugging, the practice of coating your face with petroleum jelly at night for your skin to wake up reborn the next morning. What can this drugstore hack do for your skin and how to make the most of its virtues? We put this question to the experts in the biz, and here’s what we learned. While K-beauty popularised the term, Charlotte Palermino, a clinical cosmetic chemist and founder of Dieux Skin, believes that the virtues of petroleum jelly as a skincare saviour have been documented throughout history, with Hollywood legend Marilyn Monroe counted among its many fans. The actor is said to have used Vaseline as a primer and highlighter for delivering a soft-focus glow under the lights, and would often apply multiple layers on her face as a moisturiser. “Slugging is taking a small amount of petrolatum (Vaseline is a widely used option) and applying it on your face as the last step before bed. While it won’t add moisture or hydration to the skin, it serves as a good occlusive for sealing in moisture, thereby leaving the skin softer and more hydrated by reducing transepidermal water loss and stopping water from evaporating,” explains Palermino. So, what is the payoff you can expect in return? Dr Karishma Kagodu, a Bengaluru-based cosmetic plastic surgeon and founder of Dr Karishma Aesthetics, elaborates, “The balance of dead skin (keratinocytes) and lipids is crucial for your barrier, because lipid acts as the glue that keeps your stratum corneum, or the outermost layer of the skin, intact. So, a depleted lipid layer of your skin is fixed by the petroleum found in Vaseline.” Palermino adds that you’ll want to rely on it as an excellent sealant. “Vaseline is an occlusive, which means that it acts as a sealant. While it isn’t airtight—nothing in skincare products can form a 100 per cent seal—those with dry skin or an impaired skin barrier tend to lose more water due to the lack of oils in the skin. This leads to dry, cracker flaky or irritated skin. Applying a little bit of Vaseline over your moisturiser can help it penetrate better by slowing down evaporation.” Palermino says that its primary role is to reduce water loss, and when used after hydrating ingredients, it can assist with reducing the superficial signs of ageing. Dr Kagodu agrees, and advises, “For optimal results, apply it as a pre-bed routine after using a gentle face wash. It is important to take away all that extra sebum, makeup at night before applying Vaseline or petroleum jelly. Wash your face and remove all the dirt particles collected on your face and then follow the usual routine of cleanser, toner and moisturiser. Over here, the moisturiser is Vaseline, so apply it as the last step after cleansing and toning your facial skin. It is good to apply a little rosehip oil or rose water before applying Vaseline jelly all over your face.” While slugging can serve as a saviour for dry or mature skin, both experts advise against using it for acne-prone skin. “Those with oily, acne-prone or sensitive skin must be cautious about not only using products with petrolatum, but any product which is occlusive to the skin as it may clog your pores,” cautions Dr Kagodu. In skincare circles, you’ll find that concerns are also often raised about the nature of petrolatum as an ingredient. Palermino explains, “In the US, the FDA recognises petrolatum as a skin protectant, which means that brands can legally make claims about healing skin. However, products with 30 per cent or more petrolatum must be registered with the FDA. While petrolatum is hardly propping up the gasoline industry, it is a by-product of the petroleum industry, and you’ll want to make sure you’re using triple-refined products as an added precaution.” This kind of fat is what makes your skin really glow Moisturiser or hydrator—which product do you need for your skin type? 7 top Korean beauty skincare trends of 2020 for glowing skin like never before By Hasina Jeelani By Prabal Sharma By Kejhal Kalra By Hasina Jeelani By Hasina Jeelani By Hasina Jeelani By Namrata Kedar See more stories Condé Nast India © 2023 Condé Nast. All rights reserved. Use of this website constitutes acceptance of our Terms of Service and Policy and Cookie Statement. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. ",
    "datetime": "2020-12-11T11:01:57.112Z",
    "url": "https://www.vogue.in/beauty/content/slugging-korean-k-beauty-trend-vaseline-petroleum-jelly-skincare"
}