{
    "title": "Will.i.am and 2NE1 ‘Gettin’ Dumb’: Listen to the K-Pop Collaboration – Billboard",
    "text": "It has long been rumored that Will.i.am's anticipated \"#willpower\" album would feature K-pop act 2NE1 -- a move that would bring the growing genre closer to the West. By\n\t\t\t\t\t\t\t\t\t\t\t\t\n\n\tJeff Benjamin It has long been rumored that Will.i.am’s anticipated “#willpower” album would feature K-pop act 2NE1 — a move that would bring the growing genre closer to the West. Many names were thrown out in the Black Eyed Pea’s fourth solo effort — like British darling Cheryl Cole — but Blackjacks, the name of their dedicated fanbase held their breath until an official tracklisting came. Explore\t\t\n\t\n\n\n\n\n\n\t\tExplore\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSee latest videos, charts and news\n\n\n\nSee latest videos, charts and news See latest videos, charts and news See latest videos, charts and news Luckily, 2NE1 made the cut on track No. 6 “Gettin’ Dumb” featuring Will’s Peas co-member apl.de.ap. There are a few similarities between the leaked will.i.am/2NE1 collaboration “Take The World On.” Again, listeners hear a house-inspired piano banger on the chorus. As well, we hear 2NE1 showing off a more explicit side of their lyrical game. Leader CL raps on the first verse, “They get none of my kitty kitty. / On my sh-t ‘cause it looks nice” using several explicatives throughout the section. This is continues with the side will.i.am brought out on “World” when CL declares, “You and I / let’s go multiply.” Related\t\t\n\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\n\t\n\t\t\n\t\t\t\t\tBTS' V Drops Two Very Different Remixes of 'Slow Dancing' Solo Single\t\t\n\t\n\n\n\n\t04/16/2013  But “Dumb” is hardly a rehash of “World” as it breaks into a wacky, dubstep production on the verses as well uses far less Auto-Tune. Lead vocalist Bom and CL sound clear and powerful on their sections. Though, Blackjacks may be sad to hear members Minzy and Dara used sparingly. The inclusion of apl.de.ap is suspect too as 2NE1 is more than capable of holding their own as rappers and singers, but the extra appeal of a mini Black Eyed Peas reunion on “Dumb” could bring in more listeners who may not know the group. “#willpower” will be released April 23. Recently, CL sat down with Billboard and predicted her group’s K-pop comeback to place in April. With the month half over, it looks unlikely (schedules in K-pop change all the time), but if their surprise performance at PSY’s Happening concert was any indication, 2NE1 is more than ready to hit the stage again. Get weekly rundowns straight to your inbox A daily briefing on what matters in the music industry Send us a tip using our anonymous form. A daily briefing on what matters in the music industry Send us a tip using our anonymous form. Billboard is a part of Penske Media Corporation. © 2023 Billboard Media, LLC. All Rights Reserved. ",
    "datetime": "2013-04-16T21:20:00+00:00",
    "url": "https://www.billboard.com/music/music-news/william-and-2ne1-gettin-dumb-listen-to-the-k-pop-collaboration-1558293/"
}