{
    "title": "Winterizing Skincare Routine - How to Prep Skin For Winter - Tricks of the Trade",
    "text": "Every item on this page was chosen by an ELLE editor. We may earn commission on some of the items you choose to buy. Every Monday, we tap an industry expert for little-known tips. This week, Sofia Visan, facialist at Aida Bicaj in New York (the skincare haven of Jenna Lyons, Harley Viera-Newton, and Aerin Lauder), explains how to adjust your skin routine for the rapidly dropping temps. 1. Embrace a little hibernation. \"Try to avoid staying outside for prolonged periods of time. Sudden temperature changes make your skin dry and red, contributing to broken capillaries. When you do go out, always make sure you moisturize your skin thoroughly.\" 2. Play the balancing act. \"Combat redness by keeping the skin balanced. Do this by toning and exfoliating the skin—you'll take away the dead cells so the 'new' skin can breathe better and better absorb the products. Just by exfoliating the skin, you are already preventing dryness.\" 3. Shake up your lineup. \"Switch to heavier moisturizers and different serums—the ingredients are more powerful, and they are designed to prevent dryness and redness. Use creams developed for colder weather, such as Biologique Recherche Crème Verte Espoir, and a thin layer of Biologique Recherche Masque Crème Biofixine at night. Masques are super essential in your skincare regimen as well.\" 4. Nip redness in the bud—or, blood. \"Try to avoid eating spicy foods, drinking red wines, using hot water on your face, or doing anything that increases blood circulation. All of those sorts of things contribute to redness.\" 5. But above all else, defer to an expert. \"Remember that experts do treatments that you cannot perform in home. Ask your trusted esthetician for the right products for your skin type and skin condition. By visiting [a professional], you are giving the finest tune up to your skin possible, and by using proper products at home, you maintain your glowy, toned complexion.\" Related: Insider Skincare Tips from a Facial Guru Related: The Best Winter Moisturizers For Every Skin Type 13 Best Japanese Skin Care Products to Shop Amazon Is Having a Major Beauty Sale Right Now Why Matrix Could Be the Next Best Skin Treatment Claudia Sulewski Launches CYKLAR First Class Beauty 2023 The 14 Best Expert-Approved Setting Sprays Austin Butler Doesn’t Think He’s a Beauty Icon Jelly Nails Are Back and Better Than Ever The Best Spring 2024 Beauty Trends to Try Now Add These K-Beauty Prime Day Deals to Your Cart The 20 Best Pore Minimizers for Baby-Smooth Skin Laneige’s Lip Sleeping Mask is on Sale Again A Part of Hearst Digital Media We may earn commission from links on this page, but we only recommend products we back. ©2023 Hearst Magazine Media, Inc. All Rights Reserved. ",
    "datetime": "2014-11-17T11:00:00Z",
    "url": "https://www.elle.com/beauty/makeup-skin-care/news/a19934/insider-tips-for-winter-skincare/"
}