{
    "title": "With technology, Beautytap and Bloomingdale's bring personalized Korean beauty to South Coast Plaza - Los Angeles Times",
    "text": "Kim Ressler, a Corona del Mar resident, watched as a smart mirror scanned her reflection and analyzed her skin’s problem areas. Then the mirror listed recommendations for skincare products available in Beautytap’ store. The popular Korean beauty website has moved to a new retail location in South Coast Plaza. The company previously operated a pop-up store in the mall in 2018, and now has a shop in the beauty department at Bloomingdale’s. Over 350 people attended the grand opening event, called K Beauty Pop, on Oct. 26, which included panels about the K-beauty regimen and the global rise of Korean culture. Guest speakers included “Live from E!” co-host Melanie Bromley, “The LadyGang” podcast and TV show co-host Keltie Knight, legendary UCLA gymnastics coach Valorie Kondos Field, celebrity photographer MJ Kim and guitarist Se-Hwang Kim (formerly with N.E.X.T.), along with multiple fashion and beauty influencers. “We’re in the day and age where we all need something personal to us, [but] we don’t know what products we need,” Ressler said. “We all need something different. Seeing what it says about your skin, and seeing what you need where is awesome. It’s closer to personal than anything else.” Beautytap CEO James Sun helped Ressler interpret her results. According to the mirror’s report, her greatest concerns are large pores and dark circles, but overall, her skin is in good shape. “It’s not God,” Sun said of the smart mirror, “But it helps with analysis.” The use of smart mirrors at Beautytap reflects Sun’s goals for the company: a focus on technology and an improved buying process. A tech entrepreneur and 2005 finalist on Donald Trump’s TV series, “The Apprentice,” Sun said that most retailers’ beauty counters cater more to the brands they sell then to customers. Brands pay retailers to display their entire product lines en masse on counters or shelves, Sun said. “But now, if you look at the consumer, look at Instagram: when a lady or a guy puts a photo of their skincare or cosmetics regimen, you don’t ever see one brand,” he said. “You see six to 10 different products, and from different brands.” In order to allow Beautytap’s customers greater flexibility to mix and match their products, the company doesn’t allow brands to pay for shelf or counter space in the store. According to the website, a sourcing team in Korea seeks out products based on innovation, and tests each one before deciding whether or not to carry in store. Products are organized by their order in the K-beauty process and the skincare need they address, then displayed at three different price points — affordable, medium and premium. That way, customers can easily formulate a beauty routine based on their skin concerns and budgets. “I couldn’t do that with [products from] Tom Ford or Clinique; we have to carry the whole line,” said Preston Antonini, vice president and general manager of Bloomingdale’s. “I think that’s the way the new shopper is looking at things, this personalized regimen.” Sun and Beautytap’s ultimate mission, though, is to introduce the world to Korean culture through the business. “My philosophical goal is really around trying to use beauty products as a way of promoting diversity and multiculturalism,” said Sun, who is Korean American. “Because you’re using products from Asia, you’re learning about them and learning about other cultures, and you’re being more tolerant.” For Minji Cho, the co-founder of the Los Angeles based K-beauty content company Seoul of Skin, Korean beauty products aren’t anything new. But having a physical store dedicated to them in Orange County is. “I think K-beauty has been on the rise for a really long time, but having this event at Bloomingdale’s shows that it’s not a trend that’s going to be here and gone,” said Cho, who grew up in Seoul, South Korea. “Seoul, I would say, is where women are the most obsessed with skincare and put in the most effort. And due to that kind of market, it has the most innovation and variety of products. So I think it shows that this K-beauty phenomenon is here to stay and will grow more.” Support our coverage by becoming a digital subscriber. All the latest on Orange County from Orange County. Get our free TimesOC newsletter. You may occasionally receive promotional content from the Daily Pilot. TimesOC Oct. 25, 2023 News Oct. 25, 2023 TimesOC Oct. 24, 2023 TimesOC Oct. 19, 2023 Oct. 19, 2023 Oct. 18, 2023 Oct. 18, 2023 Oct. 12, 2023 Oct. 11, 2023 Subscribe for unlimited accessSite Map Follow Us MORE FROM THE L.A. TIMES ",
    "datetime": "2019-10-31T16:50:50.228",
    "url": "https://www.latimes.com/socal/daily-pilot/entertainment/story/2019-10-31/technology-beautytap-and-bloomingdales-personalized-korean-beauty-south-coast-plaza"
}