{
    "title": "Woman reportedly spends $30K to look like Kim K. | CNN",
    "text": "Leeson recently appeared on a UK morning show She says she was often bullied According to ITV it's cost her a relationship Justin Bieber isn’t the only famous face being copied via plastic surgery. Claire Leeson recently appeared on the United Kingdom’s ITV program “This Morning” to discuss how she has spent almost $30,000 to look like Kim Kardashian. Us Weekly reports that Leeson became obsessed with looking like the reality star after watching E!’s “Keeping Up with the Kardashians” in 2009. Man spends $100k to look like Bieber “When I get my Kimmy on I feel like I’m unstoppable,” the Essex, England, resident reportedly said. Leeson said she had been bullied in the past and called the ‘ugliest thing alive.’ “ “When I left school, friends would tell me that I had a resemblance to Kim,” she said. “I watched (‘Keeping Up with the Kardashians’) and realized I had the same amount of siblings and that we have the same kind of arguments and things going on. I thought she was so beautiful and I really wanted to be like her.” Leeson’s Instagram account features plenty of evidence of all that goes into her looking like a Kardashian including breast augmentation, spray tanning and hair extensions. The price of such upkeep has also been more than monetary, however. According to ITV’s website, “Now Claire gets regular work as a Kim lookalike, and even though her obsession has got her into £6000 debt, and destroyed a relationship, she doesn’t intend to give up her lookalike career!” Songwriter Toby Sheldon has reportedly spent $100,000 to look like singer Justin Bieber. © 2023 Cable News Network. A Warner Bros. Discovery Company. All Rights Reserved.  CNN Sans ™ & © 2016 Cable News Network. ",
    "datetime": "2014-07-16T19:41:48Z",
    "url": "https://www.cnn.com/2014/07/16/showbiz/celebrity-news-gossip/kim-kardashian-plastic-surgery-claire-leeson/index.html"
}