{
    "title": "WonderLab: The latest K-beauty brand to hit Brunei - The Scoop",
    "text": "K-beauty enthusiasts rejoice, WonderLab has just opened its first space in Brunei, bringing in three of Korea’s most sought-after skincare brands. On Saturday, the store launched the latest product lines from HaruHaru, Well Nature and WonderDewi to an eager crowd of customers at Aman Hills Shopping Complex. Managing Director Wong Hui Ting said WonderLab focuses on minimalism and simplicity, combining natural ingredients with innovative skincare technology from Korea. Here’s the lowdown on the brands on offer at WonderLab:  Haruharu (which means “every day” in Korean) is a brand that promotes honest beauty using natural and fermented formulas. Haruharu’s goal is to rewind the negative impacts of skin damage with nature’s most effective and powerful ingredients. Made from Korean black rice and other natural ingredients, the HaruHaru Wonder Black Rice series uses natural fermentation techniques to help increase absorption and maintain your skin’s health.  The Well Nature series utilises germinated seeds that provide tons of moisture, such as rice germ extract, bean sprout extract and horseradish extract. The seeds are germinated within seven days, when their active ingredients are in their purest and most powerful state.  Well Nature’s Patented Dust Mirror Base technology uses the principles of magnetism to repel the negative ions (fine dust/pollution) away from the skin, while attracting the positive ions towards the skin for maximum benefit.  Who doesn’t want healthy, hydrated skin? The WonderDewi sheet masks are formulated using natural plant extracts to nourish all skin types. There are four different mask types – Dewi Hydro, Dewi Bright, Dewi Repair and Dewi Soothe. They contain key ingredients such as hyaluronic acid, pearl extract, pink aloe and natto gum to soothe, hydrate and repair your skin. WonderLab is offering Brunei’s first sheet mask subscription programme, packaged into three different WonderKits for seven, 14 and 28 days. With a gentle formula tested by dermatologists, the masks are gentle and suitable for every day use. The 14-day WonderKit is priced at just $29 while the 28-day WonderKit goes for $53. You can purchase them directly from WonderLab or any Cuckoo store. Want to discover more WonderLab products? Head to their website, Facebook or Instagram pages. You can also reach them at 2333330. Follow us on YouTube Copyright [wpsos_year] Scoop Media ",
    "datetime": "2020-10-10T22:37:13+00:00",
    "url": "https://thescoop.co/2020/10/11/wonderlab-the-latest-k-beauty-brand-to-hit-brunei/"
}