{
    "title": "Yoon Mi Rae Holds Off 12 G-Dragon Tracks for Second Week Atop K-Pop Hot 100 – Billboard",
    "text": "Chart notes on this week's K-Pop Hot 100 featuring Yoon Mi Rae, Drunken Tiger, JYP, G-Dragon, Zia and more. By\n\t\t\t\t\t\t\t\t\t\t\t\t\n\n\tJeff Benjamin Yoon Mi Rae (aka T) continues a second week atop the K-Pop Hot 100 with soundtrack ballad “Touch Love,” recorded for the Korean drama “Master’s Sun.” The SBS TV series, starring Gong Hyo Jin and So Ji Sub, hit its highest rating on Sept. 12 at 19.3% (an 1% increase from last week’s viewer rating at 18.3%), according to Nielsen Media Research. Another single to the drama, “Crazy of You” by SISTAR’s Hyorin drops to No. 5 from No. 2. With the drama’s popularity steadily growing, the singles are expected to hover near the Top 10 in the following weeks.Currently, Yoon Mi Rae is also sweeping Korea’s real-time music charts with her husband, Drunken Tiger, and his longtime collaborator Bizzy. Drunken Tiger released hotly-anticipated EP, “The Cure,” on Sept. 13 under new music label, FEEL GHOOD Music. The title track is an inspirational track that gives hope to those that are going through tough times with uplifting lyrics. It’s expected to make a big splash on next week’s K-pop chart. Related\t\t\n\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\n\t\n\t\t\n\t\t\t\t\tBTS' V Drops Two Very Different Remixes of 'Slow Dancing' Solo Single\t\t\n\t\n\n\n\n\t09/14/2013 Despite an impressive Billboard 200 entry, superstar G-Dragon misses a No. 1 on the K-pop singles chart. “Crooked,” one of the singles off his new EP “Coup D’Etat, Pt. 2,” comes in at No. 2. The entry is GD’s highest-charting entry on the K-Pop Hot 100. G-Dragon Backstage at KCON 2013 Though, G-Dragon shouldn’t be too sad about missing No. 1. Twelve tracks crash onto this week’s K-Pop Hot 100 ranging from Nos. 2 through 52. His chart dominance is as follows: No. 2 “Crooked”No. 3 “Black (Feat. Jennie Kim Of YG New Artist)”No. 4 “Who You?”No. 13 “I Love It (Feat. Zion.T & Boys Noize)”No. 15 “COUP D’ETAT” (Feat. Diplo & Baauer)No. 17 “Go”No. 21 “R.O.D.” (Feat. Lydia Paek)No. 26 “Runaway”No. 29 “Shake the World”No. 38 “Niliria (G-Dragon Ver.)”No. 43 “Niliria (Feat. Missy Elliott)”No. 52 “You Do (Outro)” A girl power-full duet between female soloist Zia and Davichi member Lee Hyeri makes a big debut on the chart with “If You Love Me” zooming into the chart at No. 7. The soaring ballad combines strings, piano and a harmonica to back the girls’ impressive vocal performance. Its accompanying music video stars handsome INFINITE and INFINITE H member Hoya and gorgeous Sunny Hill member Misung.  The head producer of JYP Entertainment, JYP (also known as Park Jin Young), debuts in at No. 30 with his comeback track “Had Enough Parties,” off his 10th LP, “Halftime.” The single reflects back on his 10-year career as a producer, singer and actor. It expresses his new purpose as well as outlook on life as he pledges, “I hope to close my eyes without fear and take brisk steps knowing exactly where I’m going.” Another new J.Y.P. track, “Love Is the Best” with Nam Goong Song Ok and Gaeko of Dynamic Duo, dents the chart at No. 12.  Daily newsletters straight to your inbox Send us a tip using our anonymous form. A daily briefing on what matters in the music industry Send us a tip using our anonymous form. Billboard is a part of Penske Media Corporation. © 2023 Billboard Media, LLC. All Rights Reserved. ",
    "datetime": "2013-09-14T16:48:18+00:00",
    "url": "https://www.billboard.com/pro/yoon-mi-rae-holds-off-12-g-dragon-tracks-for-second-week-atop-k-pop/"
}