{
    "title": "Yoon Mi Rae Earns First K-Pop Hot 100 No. 1 With ‘Touch Love’ – Billboard",
    "text": "A deeper look at the K-Pop Hot 100 this week featuring Yoon Mi Rae, SISTAR's Hyorin, TEEN TOP, Sunmi, Lyn, SPICA and more. By\n\t\t\t\t\t\t\t\t\t\t\t\t\n\n\tJeff Benjamin With over two decades in the industry under her belt, rapper/singer Yoon Mi Rae has a huge new hit with her single “Touch Love,” a soundtrack contribution to Korean drama “Master’s Sun.” While Yoon Mi Rae (also known as T) is known for helping introduce South Korea to the then-absent hip-hop genre, this ballad sees the American flexing her R&B sensibilities. Explore\t\t\n\t\n\n\n\n\n\n\t\tExplore\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSee latest videos, charts and news\n\n\n\nSee latest videos, charts and news See latest videos, charts and news See latest videos, charts and news The heartfelt midtempo track features Yoon Mi Rae (who’s also a member of trio MFBTY) delivering quivering vocals calling out for love. With the piano ballad anchored around an earworm of a hook, expect this one to float around the K-Pop Hot 100 for awhile. Related\t\t\n\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\n\t\n\t\t\n\t\t\t\t\tBTS' V Drops Two Very Different Remixes of 'Slow Dancing' Solo Single\t\t\n\t\n\n\n\n\t09/05/2013 “Touch Love” replaces last week’s No. 1, SISTAR singer Hyorin’s “Crazy of You,” both of which are lifted from the soundtrack of “Master’s Sun.” There are still seven episodes to go in the popular drama: with such impeccably chosen songs, could we see even more No. 1s from its soundtrack? In related news, the official music video for “Crazy of You,” at No. 2 this week, premiered on Sept. 3. The visual highlights emotional scenes from “Master’s Sun.”  Original Wonder Girl member Sunmi, who left the group in early 2010 to be replaced by current rapper/singer Lim, is now finding solo stardom with her first single, “24 Hours.” Despite missing out on over two years of overseas promotions with the Wonder Girls (including a proper U.S. single, “Like Money,” featuring Akon), Sunmi nets a big hit with a hard-hitting pop track enhanced with a tango-inspired section. The sexy music video has over a million views. Sunmi’s high chart position is a good look for JYP Entertainment, who have only seen similarly successful results with their idol group 2AM on the singles tally. The “queen of OST,” Baek Ji Young, makes a splash on the chart at No. 6 with “Is Crying.” The sorrow-filled ballad is the main soundtrack single to a popular Korean TV drama, “Good Doctor.” Baek Ji Young’s vocal prowess tells a story of a broken-hearted woman who can’t do anything but cry over her lost love.  Following the April release of “LYn 8th #1,” female vocalist Lyn (who had a four-week No. 1 with “To Turn Back the Hands of Time” returns with the second part of the album, “LYn 8th #2.” Lead single “I Like This Song,” climbs to the No. 8 this week. Produced by Duble Sidekick (SISTAR, B.A.P, T-ara N4), the pop track is a melodic number built on acoustic guitar riffs and piano lines where Lyn expresses her feelings to a new crush. Another track off the release, “Song For Love,” is a R&B-influenced pop track which lands at No. 75 this week. Rising girl group SPICA makes a suprising chart move with their new single, “Tonight.” Despite barely even cracking the K-Pop Hot 100 Top 40 since their 2012 debut, their latest rockets to the No. 9 slot for a massive debut. The success may be chalked up to the quintet having K-pop veteran diva Lee Hyori — who netted her own No. 1 single this year — acting as producer and style consultant for the girls’ new single. Lee brought the group an up-tempo, accessible pop track that also showed off their powerhouse vocals, plus a flirty style that looks torn out of the summer catalog at Urban Outfitters. Watch the girls get their hipster on below: In other chart news, popular boy band TEEN TOP earns another Top 10 entry with their new single, “Rocking.” Notably, the track was premiered live at KCON 2013 in Los Angeles last month. Check it out below: Get weekly rundowns straight to your inbox A daily briefing on what matters in the music industry Send us a tip using our anonymous form. A daily briefing on what matters in the music industry Send us a tip using our anonymous form. Billboard is a part of Penske Media Corporation. © 2023 Billboard Media, LLC. All Rights Reserved. ",
    "datetime": "2013-09-06T01:55:32+00:00",
    "url": "https://www.billboard.com/music/music-news/yoon-mi-rae-earns-first-k-pop-hot-100-no-1-with-touch-love-5687070/"
}