{
    "title": "You Probably Need This Cheat Sheet for Asian Beauty Ingredients | Allure",
    "text": "By Renee Jacques It's no secret that we love beauty imports from Japan and Korea (and if you need any more evidence, see here, here, and here). But sometimes, all these new ingredients can get kind of confusing. What exactly is syn-ake? And what happens if you put snail secretion on your face? In the quest for knowledge about what's in our beauty products, Darien Chen, an illustrator who is \"really into skin care\" created this amazing chart that highlights 18 of the ingredients most commonly used in many Asian beauty products. He told us that most of the information in the chart was pulled from product claims, web sources, and actual user experiences from the subReddit called Asian Beauty. Chen explained that many of the ingredients on the chart—like rice water, ferment, and green tea—have been used in Asian communities for decades and that his mother used to wash her face with rice water in the mornings to brighten her complexion. \"Unfortunately, because many of these ingredients have only recently become popular, a lot of them do not have readily available research studies in English,\" says Chen. \"The guide is meant to be a quick cheat sheet to give you a feel of what a product is supposed to do. While it's not foolproof, the goal is to quickly inform people about which ingredients to keep an eye on when looking for help with a specific concern.\" Check out the chart below (click on the image for a larger version): • 11 Korean Beauty Products That'll Transform Your Skin • 9 Korean Drugstore Beauty Products We Can't Live Without • 13 Japanese Beauty Products That Will Change Your Routine Forever By signing up, you agree to our User Agreement and Privacy Policy & Cookie Statement. By Sarah Han By Angela Trakoshis By Sarah Han By Nicola Dall'Asen More from Allure The BEAUTY EXPERT Contact © 2023 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our \n             User Agreement and Privacy Policy and Cookie Statement and \n            Your California Privacy Rights. \n            The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. \n            Ad Choices. ",
    "datetime": "2015-05-12T14:15:00.000Z",
    "url": "https://www.allure.com/story/asian-beauty-ingredients-cheat-sheet"
}