{
    "title": "You can now buy K-beauty snail mucin skincare at Woolies",
    "text": "I asked Australian creatives where they get their nails done  reading You can now buy snail mucin skincare at Woolies UP NEXT An excerpt on obsessive beauty culture from new Australian release, ‘Skin Deep’  Competitions,\n                                Features,\n                                Shoots,\n                                Collections,\n                                Reviews,\n                                Books,\n                                Health,\n                                Travel,\n                                DIY & Recipes,\n                                Videos IMAGE VIA @stylestory_kbeauty/INSTAGRAM WORDS BY IZZY WIGHT A series of K-beauty products will now be stocked at the supermarket. Are the ‘fresh food people’ getting a fresh face? Maybe, with today’s announcement the grocery giant is now stocking a selection of K-beauty products. Renowned for its meticulous formulations, layering philosophy and hydrating properties, a Korean skincare offering is now available to shop through Woolworths’ Everyday Market online store. The move is the result of a partnership with Australian K-beauty platform, Style Story. Founded in 2014 by Brisbane-based beauty enthusiast Lauren Lee, Style Story has grown from a basement-run operation to a global K-Beauty platform. As is often the case, Korean skincare was once almost impossible to find in Australia (I know from paying exorbitant fees in parcel forwarding). Style Story has brought a diverse collection of affordable, award-winning K-beauty products to our faces – and now our grocery baskets. So which K-beauty products can you pick up with your bread and milk? The current Woolies offering is a selection of the internet’s most beloved beauty and skincare gems. It includes FJ’s tried-and-true snail mucin slime. And not one, but two jelly-textured sleeping masks! How far the humble grocery store has come. Alongside the bestselling Cosrx cleanser, arrivals include a green tea seed-infused eye cream, an iridescent skin balm, a cloud-like enzyme cleansing foam, a cherry blossom-scented face mask and Laneige’s famous Lip Sleeping Mask. I don’t know about you, but I’m looking forward to picking up snail mucin with my spaghetti bolognese ingredients. Shop Woolies’ full skincare offering here. An excerpt on obsessive beauty culture from new Australian release, ‘Skin Deep’ Is it worth buying the expensive version of skincare products if you can afford it? I trawled Reddit for the internet’s best skincare and makeup recommendations How to tell if your skincare or makeup has expired 8 Mecca employees share their most underrated beauty products How double cleansing cleared up my long-term acne Australian makeup artists share the beauty products they use most Δ ",
    "datetime": "2022-03-17T23:31:16+00:00",
    "url": "https://fashionjournal.com.au/beauty/k-beauty-woolworths/"
}