{
    "title": "Your Two Favorite Places—Target and Ulta—Are Now Becoming One",
    "text": "Every item on this page was chosen by an ELLE editor. We may earn commission on some of the items you choose to buy. Gone are the days of multi-stop trips to Target and Ulta Beauty for beauty finds. Thanks to a new partnership between the two retailers, you'll be able to snag all of your favorite Ulta Beauty products while checking off your to-do list inside Target. Ulta Beauty at Target is a new immersive experience designed as a shop-in-shop. Located next to Target's own beauty section, the new partnership was birthed out of a desire to introduce Target customers to brands not available at the popular one-stop-shop. Where Target has always housed brands like Sonia Kashuk and No7, Ulta Beauty has a more expansive assortment of brands that can enhance the beauty experience at Target, including Uoma Beauty, Colourpop, Lancome and more. \"We couldn’t be happier about bringing these two trusted brands together to redefine retail beauty experiences,\" Brian Cornell, Target’s chairman and CEO, says in a press release. \"This matchup brings Ulta Beauty’s coveted prestige beauty assortment, category expertise and guest loyalty together with Target’s high-growth beauty business and the ease and convenience of our industry-leading fulfillment services.\" Target also has plans to train its staff to perform the same consultative services customers receive in a regular Ulta Beauty store. Plus, Target’s contactless same-day fulfillment services—Drive Up, Order Pickup and Shipt—will be available for Ulta Beauty at Target purchases at participating locations. But don't run to Target or jump on the website just yet—the first Ulta Beauty at Target locations will launch in 2021. In the meantime, shop our favorite beauty picks from Target and Ulta Beauty. Nerisha is the beauty commerce editor at ELLE.com, covering all things beauty (and fashion and music). She has a penchant for sneakers and nude lip glosses, and spends way too much time re-watching 90s sitcoms. 13 Best Japanese Skin Care Products to Shop Amazon Is Having a Major Beauty Sale Right Now Why Matrix Could Be the Next Best Skin Treatment Claudia Sulewski Launches CYKLAR First Class Beauty 2023 The 14 Best Expert-Approved Setting Sprays Austin Butler Doesn’t Think He’s a Beauty Icon Jelly Nails Are Back and Better Than Ever The Best Spring 2024 Beauty Trends to Try Now Add These K-Beauty Prime Day Deals to Your Cart The 20 Best Pore Minimizers for Baby-Smooth Skin Laneige’s Lip Sleeping Mask is on Sale Again A Part of Hearst Digital Media We may earn commission from links on this page, but we only recommend products we back. ©2023 Hearst Magazine Media, Inc. All Rights Reserved. ",
    "datetime": "2020-11-10T17:02:00Z",
    "url": "https://www.elle.com/beauty/makeup-skin-care/a34629895/target-ulta-beauty-partnership/"
}