{
    "title": "Zooey Deschanel's Domino Nail Art 2013 Emmys - Tom Bachik Nail Polish Looks",
    "text": "Photo: Courtesy of Tom Bachik Zooey Deschanel has become the irrefutable monarch of awards show nail art. From her glittery TV tube nails at last year's Emmys to the camera reel motif she rocked at the Golden Globes, the New Girl actress never disappoints when it comes to decorated digits. Tonight was no exception: Deschanel sported graphic domino tips for the Emmy Awards. Related: 2014 Emmys Hair, Makeup, Dresses and More \"Modern geometric art was the inspiration,\" said her nail whiz, Tom Bachik. \"We wanted something that was really going to pop off the nails to complement her glamorous and formfitting baby blue dress. It's a new interpretation of a '60s look.\" To get the design, Bachik first painted nails with the white L'Oreal Colour Riche Nail in I Will!, and then used the Models Own Nail Art Pen in Black to draw a plus sign across the middle of each nail. After filling in two of the four squares with the black paint, he topped off a couple of the squares with black or white sequins to achieve a dice-like look. Finally, for the thumbs, Bachik hand-painted playful mustaches for a punch of Deschanel's signature quirkiness. \"The mustache happened by total accident,\" Bachik explained. \"When we were playing around with designs, I wiped off excess nail polish on a tray and the swipe looked like a messy mustache, so Zooey asked if we could add the idea!\" Simple Nail Designs for Your Manicure Mood Board 14 Vanilla Perfumes That Smell Absolutely Amazing 13 Best Japanese Skin Care Products to Shop For Breast Cancer, 40 Is the New 50 Meet YSL Beauty’s Most Unconventional Scent Yet Amazon Is Having a Major Beauty Sale Right Now Why Matrix Could Be the Next Best Skin Treatment The Best Neutral Nail Colors for Every Skin Tone Claudia Sulewski Launches CYKLAR Beyoncé Is Finally Releasing a Perfume A No-Damage Routine for Colored Hair First Class Beauty 2023 A Part of Hearst Digital Media We may earn commission from links on this page, but we only recommend products we back. ©2023 Hearst Magazine Media, Inc. All Rights Reserved. ",
    "datetime": "2013-09-22T21:00:00Z",
    "url": "https://www.elle.com/beauty/news/a23759/zooey-deschanel-domino-nail-art-emmys/"
}