{
    "title": "‘9 Muses of Star Empire’: Film Review – Billboard",
    "text": "K-pop haters will completely shift their paradigm after watching the documentary \"9 Muses of Star Empire,\" now on its way to North America. By\n\t\t\t\t\t\t\t\t\t\t\t\t\n\n\tJeff Benjamin  K-pop haters will completely shift their paradigm after watching “9 Muses of Star Empire.” The eye-opening documentary — which makes its North American premiere on July 26 (more info below) — shows what goes into creating an act for the market. It follows the story of Korean record label Star Empire Entertainment, which spends more than a million dollars to debut girl group 9 Muses in 2010. If the story truly represents what goes on behind the K-pop scenes, then there’s lots of tears, disappointment and rehearsing until you’re sick. Playing off their Greek goddess-inspired name, 9 Muses are marketed as nine model-esque girls crafting sexy, sassy K-pop. While the viewer does not see how the original nine were selected, when one member leaves 9 Muses, the Star Empire execs go to an agency that show them binders full of women (seriously) for the company to pick one to add to the group. The shallow means necessary to become a K-pop star seem to be highlighted, as execs first and foremost need a girl who is similar age of the other girls and is tall with singing and dancing capabilities an afterthought. Related\t\t\n\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\n\t\n\t\t\n\t\t\t\t\tBTS' V Drops Two Very Different Remixes of 'Slow Dancing' Solo Single\t\t\n\t\n\n\n\n\t07/25/2013\t\n\n\n\n\n\n\n\n\n\n\t\n\t\n\t\t\n\t\t\t\t\tExplore\t\t\n\t\n\n\n\n\n\n\t\tExplore\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSee latest videos, charts and news\n\n\n\nSee latest videos, charts and news See latest videos, charts and news See latest videos, charts and news The star of the documentary is Sera, the original leader of the K-pop outfit. The viewer heartbreakingly follows the likable singer as she enthusiastically tries to encourage her members to work hard, though her effort is met with crushing results when she is blamed for 9 Muses’ lack of success and removed from the position. Moreover, while the doc highlights the glamorous life of shooting music videos and TV appearances, a dark side emerges in seeing the girls criticized for their makeup or when certain members get minimal TV show screen time. A critical moment of the doc comes when the group finally makes their TV debut and, despite a highly technical performance most Western girl groups could only dream of pulling off, 9 Muses’ debut performance of “No Playboy” is considered a disaster.   The second half of the doc comes after the “No Playboy” debut when the mood is shifted with an unspoken (or unseen?) newfound focus on excruciatingly hard work. Now, rehearsals are absolutely mandatory even when the girls, bruised and bandaged from a car crash, continue their rigorous practice. A standout tragic moment comes when a sick member is crying in a backroom, telling another, “I can’t tell him that I’m sick… they are the type of people who will give a painkiller and make me dance through tears.” By the end of the documentary, it’s clear 9 Muses’ discipline changed the group as the girls rehearse in hallways a minute up until going on stage. But at what cost? The brilliant final scene ends with Sera singing a ballad in a rehearsal room. She tells the camera, “This could have been a beautiful documentary if it was up till our debut,” agreeing that their lives became much more rigorous after their flaws were exposed on national TV. The doc leaves the viewer with an uncomfortable emotional stirring, wondering if these performers can truly be happy in the K-pop life, as Sera admits her stress is only relieved when she sings, despite a contradictory teardrop sliding down her face signaling otherwise. Despite a few typos on the translated captions, the documentary’s message is clear: “9 Muses of Star Empire” is ultimately an examination of how humans treat each other — whether you’re an artist or a CEO — while following dreams in the Korean entertainment biz. Directors: Hark-Joon LeeExecutive producer: Chung-Oh BangProducers: Suk-Kee Lee, Style Chosum and Min-Chul Kim, Mich & FilmsRunning time: 82 minutes North American Premiere: July 26 at Film Society of Lincoln Center, as part of its Sound + Vision series, at 4:30 p.m. There is another viewing on July 30 at 8:30 p.m. Get tickets here. Luckily, there is a happy ending for 9 Muses that the documentary doesn’t show. The group is back together with nine members, which is beneficial for their namesake. As well, their latest single, “Wild,” peaked at No. 18 on the K-Pop Hot 100 chart in May, continuing the group’s upward chart climb.  Get weekly rundowns straight to your inbox A daily briefing on what matters in the music industry Send us a tip using our anonymous form. A daily briefing on what matters in the music industry Send us a tip using our anonymous form. Billboard is a part of Penske Media Corporation. © 2023 Billboard Media, LLC. All Rights Reserved. ",
    "datetime": "2013-07-26T03:09:12+00:00",
    "url": "https://www.billboard.com/music/music-news/9-muses-of-star-empire-film-review-4663593/"
}